{
  "url": "https://riviantrackr.com/news/rivian-responds-to-lfp-battery-range-fault-after-multiple-owner-incidents",
  "path": "/news/rivian-responds-to-lfp-battery-range-fault-after-multiple-owner-incidents",
  "title": "Rivian Responds to LFP Battery Range Fault After Multiple Owner Incidents",
  "text": "Skip to content\nRivian finally sent an email today about the Dual Standard LFP range estimation issue, and it confirms what a lot of owners have been dealing with quietly for weeks. The message explains that a software calibration problem can cause the range estimate to get less accurate as the state of charge drops, especially below 20%. The fix is part of OTA 2025.38.30, and Rivian is asking owners to charge to 100% more often over the next few weeks so the estimator can recalibrate.\nThe email makes it clear this is a software issue and not a failure of the battery itself. That is the good news. The frustrating part is that not everyone was told about this until today. Some Dual Standard owners received some sort of notice, others did not, and some only learned about the problem after their vehicle left them stranded. That inconsistency is exactly what worries people.\nHey all, quick little video explaining the whole situation and what Rivian has done so far to help. I’m only hopeful we can prevent this specific issue from happening to anyone else 🙂 https://t.co/x9CKNwnGxD pic.twitter.com/RgtSEtPDsj— Jose | RivianTrackr (@RivianTrackr) November 23, 2025\nOver the weekend I shared a series of tweets about a friend who ran into the worst version of this problem. His R1S showed more than 20% state of charge before it suddenly died on the side of the road during a family roadtrip. They were stuck for four hours waiting for a tow, then both a DC fast charger and a Level 2 charger faulted. The vehicle had to be hauled from Jacksonville to Orlando, and he had to rent a gas car just to keep his trip going.\nThis kind of thing damages confidence. Most owners are happy to deal with a bug if the company gets ahead of it and communicates clearly. The problem here is that the communication was partial. Some people got the warning and the update instructions, others didn’t, and in a situation that can leave families stranded, uneven messaging is a real issue.\nRivian has been improving fast and doing a lot of things right, but moments like this make it clear why new automakers have to over communicate. When a range estimator is off by that much, owners deserve a direct, universal heads up and a clear explanation of what to do next.\nTrust in an EV starts with trusting the numbers on the screen. Rivian’s email today is a step in the right direction, but the rollout shows they still need to tighten how they handle issues that affect safety and basic usability. Until every owner gets the message, people are going to keep finding out the hard way.\nThank you Jose for sending this in.\n 5 Comments \n I had this issue. Navigation showed 37 miles when I would arrive at the Rivian fast charger. Then, suddenly, down to zero range now. It still let me drive, long enough to get a mile to a level 2 charger, where I charged a long while, then moved to the fast charger only a few miles further.\nRivian actually called me a week or two ago to mention the fix in this release. It sounded like the guy was calling a lot of owners, and had been expecting to just leave a voicemail. I upgraded to the new release as soon as it became available to me.\nAnd today I got the email described in this article.\nI suspect that Rivian rushed out this bug fix release to ward off (further) bad press from the problem. It’s disconcerting when it happens, as I had just allowed the navigation to choose a charger in that part of the route. That, plus having stayed longer at the previous fast charger than navigation said was necessary, and having the cruise control and highway assist (where it was available) at the speed limit, left me thinking…heck, what, can I trust this thing?\nCompounding this is the inability to set the desired state of charge on arrival at chargers. (You can set the desired state of charge on arrival at destination, but it doesn’t affect the planned arrival state of charge at chargers along the way. Try planning a route if you don’t believe me.)\nI had thought that I might need to manual plan chargers, or use some website or non Rivian app. Hopefully this update improves things. Worryingly, when I tried planning the same route with the updated software, either in vehicle or in the app, it choose the same chargers. Maybe calibration with at home charging to 100% will improve things, or maybe navigation had me staying longer at the first charger location when I planned after the update compared to before the update, I don’t recall what it planned the first time.\nAnyway, here’s hoping the fix solves the problem, with calibration.\n Yeah. The first time I heard about it was from you. Never got notified by Rivian.\n The Dual Standard fleet seems to be neglected in terms of software updates and improvements overall. For example we are forced to drive in Snow mode to get full time AWD, etc.\n I’ve had a similar issue and thought I just screwed up…ended up having to pay for a new 12v battery too. Vehicle said it had 40 miles, in 10 miles it said 14 and then within a mile lost power and put me on the side of the road. Within an hour of waiting for a tow truck the system was so dead a jump box could barely get the doors to open…\n I had the same issue. Left me sitting on the side of the road and then killed my 12v and required me to pay $458 to replace the 12v. Now Rivian is refusing a refund for the 12v even though the vehicle died because of their own software fault. Really disappointed in this experience.\n Leave a ReplyCancel ReplyYour email address will not be published. Required fields are marked *\n Name  *\n Email  *\n Add Comment *\n Save my name and email in this browser for the next time I comment.Post Comment \nΔ",
  "crawledAt": "2026-02-19T03:37:41.680Z"
}