{
  "url": "https://www.rivianroamer.com/terms-of-service",
  "path": "/terms-of-service",
  "title": "Rivian Roamer",
  "text": "Terms of Service for Rivian Roamer\n Effective Date: October 14, 2025\n Key Points (tl;dr)\n Here's what actually matters:\n We use unofficial Rivian APIs - Features could break if Rivian changes things\n Roamer Plus is a paid subscription - One-click cancel, automatic 14-day refund\n Your data is yours - We never share it, and you can delete it anytime\n We never store Rivian credentials - Only secure tokens that must be reviewed every 6 months\n Social features are optional - Leaderboards and public profiles require opt-in\n Handles are for identity, not promotion - No referral codes or advertising\n Referral program earns subscription credits - Both you and your friend get $4.99 off after their first paid month\n Weekend support only - We're a small team\n 45 days notice for price changes - Annual subscribers can cancel with a pro-rated refund or move to new pricing\n You must be 13+ to use this service\n 1. The Basics\n Welcome to Rivian Roamer, operated by Velocity Studios, LLC (\"we\", \"us\"). By using our website (rivianroamer.com), you agree to these Terms. We're based in Washington state, and these Terms are governed by Washington law.\n You must be at least 13 years old to use this service. If you're under 18, you need parental permission.\n 2. What We Provide\n Rivian Roamer provides useful information to Rivian and EV owners using unofficial Rivian APIs.\n ⚠️ Important: This service relies on unofficial APIs that may change. We're an independent service not affiliated with Rivian Automotive, Inc. By using this service, you understand that:\n Features may break without warning\n If Rivian permanently revokes access, we'll stop charging and give you time to export your data\n You use this service entirely at your own risk\n If Rivian implements API fees, we'll adjust pricing fairly to cover costs\n 3. Your Account & Data\n You're responsible for your account security. When you link your Rivian account:\n We only store secure tokens, never your Rivian password\n Tokens must be reviewed every 6 months for security\n Your data is yours - we never sell or share it\n You can delete your data anytime\n See our Privacy Policy for full details\n 4. Social Features & Leaderboards\n Rivian Roamer offers optional social features including leaderboards, achievements, and public profiles.\n Opt-In & Privacy\n All social features are opt-in - You must explicitly enable participation\n What's visible when opted in: Your handle, vehicle model/year, and stats (efficiency, distance, etc.)\n What's never shared: Your location, drive history, personal information, or any data not explicitly shown on leaderboards\n Opt-out anytime - You can disable social features at any time from your profile\n Handles & Appropriate Use\n Your handle is your public identity on Rivian Roamer. When choosing a handle:\n Be yourself - Handles are for identity and community, not promotion or advertising\n No referral codes - Handles cannot be Rivian referral codes (e.g., \"JOHN123456\"). Use the dedicated Rivian Referral Code field on your profile instead\n No impersonation - Don't pretend to be someone else or an official Rivian account\n Keep it appropriate - No offensive, harassing, or inappropriate handles\n We reserve the right to change or remove handles that violate these guidelines\n Rivian Referral Codes\n Want to share your Rivian referral code? We provide a dedicated field on your profile for this purpose. This keeps leaderboards readable while still letting you help fellow Rivian owners.\n 5. Roamer Plus Subscription\n Our premium features require a Roamer Plus subscription:\n Payment: Monthly ($4.99/month) or annual ($54.99/year) billing through our payment processor (Stripe)\n Free Trials: If offered, you'll be notified before billing begins. Cancel anytime during the trial\n Cancellation: Cancel anytime from your account settings — one click, no contact required. You get access through the end of your billing period\n 14-Day Refund: Cancel within 14 days and receive a full automatic refund. After 14 days, no refunds — you keep access through the end of your billing period\n Failed Payments: 14-day grace period before access is suspended\n Data Retention: Historical data retained for 6 months after subscription ends; billing records kept 7 years (IRS requirement)\n Price Changes\n All customers will receive 45 days advance notice before any pricing changes. If third-party costs require a price increase (e.g., Rivian begins charging for API access), annual subscribers will have two options:\n Cancel and receive a pro-rated refund for the unused portion of their annual subscription\n Move to the new pricing tier at their next renewal\n Monthly subscribers will see the new price at their next billing cycle. No one will be charged a higher rate without notice.\n 6. Referral Program\n Share Roamer Plus with other Rivian owners and you both save money. Here's how it works:\n Earning Credits\n You refer someone: Share your referral link with another Rivian owner\n They subscribe: When they sign up for Roamer Plus using your link, you're both eligible for credit\n Credits unlock: After they complete their first full month of paid subscription, you both get $4.99 in credit toward Roamer Plus\n Credits apply automatically: Your credit goes toward your next subscription payment\n The Rules\n Active subscription required: You must have an active Roamer Plus subscription to participate. No subscription = no earning or using credits\n One referral per person: Each new subscriber counts once. Different email and payment method required\n No self-referrals: You can't refer yourself with a different email. We check for this\n No fake accounts: Bot accounts, fake signups, or other abuse will get your credits revoked and possibly your account terminated\n What Happens to Credits\n While subscribed: Credits don't expire as long as you're an active subscriber\n If you cancel: All unused credits are forfeited immediately. This includes both credits you've earned and credits you were referred with\n Can't cash out: Credits can only be used for Roamer Plus subscription payments. You can't transfer them, sell them, or exchange them for cash\n Chargebacks: If either person disputes their payment, both lose the credits\n Program Changes\n We can change the program: We may modify credit amounts, eligibility, or end the program entirely with reasonable notice\n Your earned credits are safe: If we change the program, credits you've already earned will still be honored\n We might cap earnings: To prevent abuse, we may limit total credits per user\n Tax Stuff\n Referral credits are promotional rewards, not income. If you somehow earn over $600 in credits in a year (that's 120+ referrals), we'll send you a 1099. Otherwise, these are just discounts on your subscription.\n 7. Rules & Restrictions\n Don't:\n Scrape or harvest data from our site\n Try to hack or disrupt our service\n Use our service for illegal purposes\n Violate Rivian's terms of service\n Use handles for advertising, promotion, or referral codes\n Impersonate others or create misleading handles\n 8. Liability & Disclaimers\n IMPORTANT: Our service is provided \"as is\" without warranties. We are not liable for:\n Service interruptions or data loss\n Changes to Rivian's APIs\n Any damages from using our service\n Third-party websites we link to\n To the maximum extent permitted by law, our liability is limited to the amount you've paid us in the past 3 months. For free users, we have no liability for service issues.\n 9. You Protect Us (Indemnification)\n You agree to defend and hold harmless Velocity Studios, LLC from any claims, damages, or costs arising from:\n Your use of our service\n Your violation of these Terms\n Your violation of others' rights\n Any damage you cause to third parties\n Your use of social features or public content you post\n 10. Intellectual Property\n Our content is protected by copyright\n Rivian® is a trademark of Rivian Automotive, Inc. (we're not affiliated)\n Content you submit remains yours, but you grant us a license to use it for our service\n 11. Changes & Termination\n We may update these Terms at any time. We'll notify you of material changes, and your continued use constitutes acceptance of the new terms\n We can terminate accounts that violate these Terms\n You can stop using our service anytime\n 12. Disputes & Arbitration\n Binding Arbitration: Most disputes will be resolved through binding arbitration instead of court. You waive your right to a jury trial. Arbitration will be conducted by JAMS under its rules in Washington state.\n Exceptions: Small claims court actions and intellectual property disputes may still go to court.\n No Class Actions: All disputes must be brought individually, not as part of a class action.\n 13. General Legal Stuff\n Force Majeure: Neither party is liable for delays caused by events beyond reasonable control (natural disasters, Rivian API changes, government actions, etc.).\n Severability: If any part of these Terms is found invalid or unenforceable, the rest remains in effect.\n Entire Agreement: These Terms constitute the entire agreement between you and us regarding the service.\n No Waiver: Our failure to enforce any right or provision doesn't waive our right to do so in the future.\n 14. No Personal Liability\n Under no circumstances shall any member, manager, employee, or affiliate of Velocity Studios, LLC have any personal liability arising from these Terms or your use of the service. All claims must be brought solely against Velocity Studios, LLC.\n 15. Contact Us\n Questions? Email us at support@rivianroamer.com\n By using Rivian Roamer, you acknowledge that you've read and agree to these Terms.\n This action cannot be undone.\n Cancel\n Confirm",
  "crawledAt": "2026-02-19T03:39:18.054Z"
}