{
  "url": "https://riviantrackr.com/news/how-rivian-turned-its-commercial-van-into-an-electric-ambulance-for-greys-anatomy",
  "path": "/news/how-rivian-turned-its-commercial-van-into-an-electric-ambulance-for-greys-anatomy",
  "title": "How Rivian Turned Its Commercial Van Into an Electric Ambulance for Grey’s Anatomy",
  "text": "Skip to content\nRivian has added another standout project to its Commercial Van portfolio, this time for the small screen.\nFor Season 22 of Grey’s Anatomy, Rivian partnered with the show’s production team to create a fully electric ambulance built on the Rivian Commercial Van platform, dubbed the “vanbulance.” The custom vehicle was designed to function as both an exterior and interior filming set, eliminating the need for multiple ambulances during production.\nA major motivation behind the build was improving air quality and reducing noise on set. With zero tailpipe emissions and quiet operation, the electric ambulance created a cleaner, calmer environment for cast and crew while cameras were rolling.\nTo ensure authenticity, Rivian and the Grey’s Anatomy team consulted with the Los Angeles Fire Department and visited the Huntington Beach Fire Department, shaping everything from the interior layout to ingress and egress requirements. For filming flexibility, the van features removable walls and roof panels, modified doors, and custom camera and lighting mounting points.\nWhile built for a fictional hospital, the project highlights the real world potential of electric ambulances. Rivian already has R1 vehicles in service with emergency organizations today, offering a glimpse of how electric platforms could benefit first responders and the communities they serve.\n 2 Comments \n That’s actually a great use case, ambulances don’t travel very far but likely idle endlessly.\n So true….\n Leave a ReplyCancel ReplyYour email address will not be published. Required fields are marked *\n Name  *\n Email  *\n Add Comment *\n Save my name and email in this browser for the next time I comment.Post Comment \nΔ",
  "crawledAt": "2026-02-19T03:38:26.067Z"
}