{
  "url": "https://www.rivianroamer.com/help",
  "path": "/help",
  "title": "Rivian Roamer",
  "text": "Getting Started\n What is Rivian Roamer?\n Rivian Roamer is the independent, community-driven companion for your Rivian vehicle. We track software updates,\n charging performance, and vehicle insights to help you get the most from your Rivian. Built by Rivian owners,\n for Rivian owners. Not affiliated with Rivian Automotive.\n What features does Rivian Roamer offer?\n For everyone (no account required):\n Browse available inventory\n View software update release notes\n Search charging station locations\n Access community resources\n Free with linked Rivian account:\n Live vehicle status and telemetry\n Software update notifications\n Vehicle configuration details\n Vehicle birthday emails\n Roamer Plus ($4.99/month or $54.99/year):\n Drive sessions with detailed maps\n Charging curves and efficiency analytics\n Unlimited historical data retention\n Advanced trip statistics\n Unlimited vehicles per account\n How do I link my Rivian account?\n Account linking is secure and straightforward:\n Click \"Link Account\" from your dashboard\n Enter your Rivian credentials (passed directly to Rivian, never stored)\n Complete 2FA if enabled on your account\n Rivian returns secure tokens that we store encrypted\n Important: We never store your password. We use token-based authentication.\n Read our complete account linking guide\n Is it safe to link my Rivian account?\n Yes, absolutely. Rivian Roamer's integration was built in coordination with Rivian.\n We never see or store your password — credentials are sent directly to Rivian's servers, and we only\n receive encrypted tokens in return. You can revoke access anytime through your Rivian app or by changing\n your password. Thousands of Rivian owners trust us with their vehicle data.\n What data do you collect from my account?\n We collect vehicle information, charging sessions, drive data, software versions, and basic telemetry.\n All data is used to provide insights and track patterns. We never share or sell your personal data.\n Read our privacy policy for complete details.\n Can I use a secondary driver account?\n Yes! For enhanced security, you can:\n Create a secondary driver account in your Rivian app\n Link that account to Rivian Roamer instead of your primary\n Revoke access anytime from the Rivian app\n This gives you an extra layer of control over third-party access.\n Features & Data\n How are charging reliability scores calculated?\n Scores are based on successful charging sessions, reported issues, and uptime data from the\n community. More recent reports are weighted higher than older ones.\n Can I delete my account?\n Yes, you can delete your account anytime from your profile settings. This will permanently remove\n all your data, including vehicle history, charging sessions, and drive data. Account deletion is\n immediate and cannot be undone.\n Roamer Plus\n What is Roamer Plus?\n Roamer Plus is our paid tier for historical vehicle telematics, allowing you to track every mile,\n charge, and adventure. Learn more about Plus features.\n Will free features always stay free?\n Yes. Rivian Roamer seeks to provide maximum value for free. Plus features like historical data\n require more hosting costs and development effort.\n Do you offer annual pricing?\n Yes! You can choose between monthly ($4.99/month) or annual ($54.99/year) billing.\n The annual plan saves you one month — 12 months for the price of 11. You can switch\n between plans anytime from your account settings.\n What if pricing changes?\n All customers will receive 45 days notice before any pricing changes. If we need to adjust pricing (e.g., Rivian starts charging for API access), annual subscribers will have two options:\n Cancel and receive a pro-rated refund for the unused portion of their annual plan\n Move to the new pricing tier at their next renewal\n Monthly subscribers will see the new price at their next billing cycle. No one will ever be charged a higher rate without notice.\n Do you offer free trials or refunds?\n No free trials — but we do better. Cancel within 14 days and we'll automatically refund you. No email, no form, no \"contact support.\"\n Just cancel and the refund processes on its own. After 14 days, you keep access through the end of your billing period.\n Can I cancel anytime?\n Yes. One click in your account settings. No hoops, no \"chat with an agent,\" no guilt trip. Cancel and you're done.\n If it's within 14 days, your refund is automatic.\n What happens when I cancel?\n Your Plus access continues through the end of your current billing period — no immediate cutoff.\n You keep all Plus features until your subscription expires. We don't do prorated refunds, but you\n get what you paid for.\n What happens if my payment fails?\n Don't worry — we've got your back. You get a 14-day grace period to update your payment method.\n We'll send you friendly reminders, and your data continues collecting during this time. No sudden cutoffs.\n What happens to my data if I cancel?\n Your data isn't going anywhere. We keep everything safe for 6 months after cancellation, so you\n can come back anytime without missing a beat. Think of it as an extended vacation — your adventure\n history will be waiting for you.\n Data & Telemetry\n Why does my battery capacity change? Am I seeing degradation?\n Probably not. The battery capacity shown in Rivian Roamer is your net battery capacity, not your total (gross) capacity.\n Rivian reserves a portion of your battery for thermal management and other system needs. This reservation varies based on conditions like temperature, which is why you may see the reported capacity fluctuate.\n Rivian does not expose the gross battery capacity through their API, so the figures shown on Rivian Roamer are not indicative of your total battery capacity or actual degradation.\n Why does my efficiency on Rivian Roamer not match my in-vehicle display?\n Rivian only exposes battery percentage and net battery capacity through their API — not the actual energy consumed.\n This means Rivian Roamer has to calculate energy usage based on the change in battery percentage and reported capacity. Due to rounding and the thermal reservation mentioned above, these calculated values may not always match what your vehicle displays.\n Can you add battery temperature?\n Unfortunately, no. Rivian does not currently expose battery temperature data through their API. Services like ABRP have access to additional data because they are owned by Rivian.\n Can you pull historical data from before I subscribed?\n No — we can only collect data from the moment you subscribe to Roamer Plus. Rivian's API provides real-time telemetry, not historical archives. Your drive and charge tracking starts when Plus starts.\n How are fuel savings calculated?\n We compare your EV driving costs against what you'd spend on fuel. The calculation uses your electricity rate, miles driven, and a reference vehicle's MPG.\n You can customize the reference MPG and fuel price in your profile settings. By default, we use 25 MPG and the weekly US national average for premium unleaded.\n How are charging sessions detected?\n A charging session is simply the time your vehicle is plugged in. It starts when you connect the charger and ends when you unplug — one continuous session per charge.\n How are drive sessions detected?\n A drive session is a period of driving where you're not stopped for too long. By default, if you park for more than 10 minutes, we'll split it into separate sessions. Quick stops — like grabbing coffee or dropping someone off — stay part of the same session.\n You can adjust this in Profile → Preferences. Set it anywhere from 0 to 60 minutes. Setting it to 0 means every stop creates a new session — useful if you want maximum detail.\n What about poor cellular connection?\n If your vehicle loses connection while driving (common in tunnels, parking garages, or rural areas), we won't split the session unless data is missing for more than 10 minutes. This \"grace period\" handles connectivity gaps so your sessions stay intact when you're actually driving.\n Importing Data\n Bring your driving history into Rivian Roamer — we'll merge it with your existing data so you have a complete picture from day one.\n Can I import data from other services?\n Yes! We currently support imports from:\n ElectraFi (formerly TeslaFi for Rivian)\n Looking for another service? Reach out to\n support@rivianroamer.com — we're always expanding.\n How does importing work?\n Export your data from your third-party service (see instructions below)\n Compress all exported files into a single ZIP\n Upload to Rivian Roamer via Dashboard → Imports → New Import\n We'll process your history — large imports may take several minutes\n What to expect:\n We import sessions from before Rivian Roamer started tracking — no duplicates\n Imported sessions won't count toward leaderboards or achievements\n Re-importing replaces previous import data for that service\n Session times display in your timezone — may differ from your export source\n Importing from ElectraFi\n How to export your data\n Export each data type separately — we'll combine them during import.\n Keep drive and charge searches to 6 months or less\n Larger date ranges can take 30+ minutes to complete. Break it up for faster exports.\n 1. Raw Telemetry\n Go to electrafi.com/export2.php\n Export each month separately — this ensures complete data\n 2. Drives\n Go to electrafi.com/tags.php\n Select a date range, then click Search\n Click Download Data and Download GPX for each result block\n 3. Charges\n Go to electrafi.com/chargeSearch.php\n Select a date range, then click Search\n Click Download Data in the bottom right\n 4. Create your ZIP\n Compress all downloaded files into a single ZIP\n Keep Your Archive Safe\n This Zip file is your only copy. For your privacy, we delete it after the import completes. Store it somewhere secure — cloud storage, external drive, wherever you won't lose it.\n What data is imported\n Included:\n Drive sessions — date, time, distance, locations, energy, efficiency, battery levels, odometer\n Charging sessions — date, time, location, energy added, battery levels, cost, range added\n Telemetry — GPS locations with elevation, battery state\n Purpose tags (Personal/Business)\n Not included:\n Drive and charge notes\n Charging voltage and amperage\n Charging efficiency (kWh used vs added)\n Savings calculations\n Troubleshooting\n My drive or charging sessions don't show a map\n This usually means the linked Rivian account has location sharing disabled.\n Applies to: Roamer Plus features (drive/charging maps)\n How to confirm or fix:\n Open your Rivian app\n Scroll down to and tap on Location\n Confirm Hide Location is toggled OFF\n If you use a secondary driver account for Rivian Roamer, ensure Hide Location is off for that account.\n After changing the setting, take a short drive or start a charge to generate new data with location.\n Learn more about location privacy with secondary accounts\n My account won't link\n Common solutions:\n Ensure you're using your Rivian account email, not Connect+ or other credentials\n Check that 2FA codes are entered quickly (they expire)\n Verify your account works in the official Rivian app first\n My vehicle isn't showing up\n If you're using a secondary account, ensure you've fully accepted the invite. You can confirm this by\n signing into your secondary account in the Rivian app — if you don't see the vehicle, you haven't\n accepted the invite. Otherwise, try unlinking and relinking your account. Some features require the\n vehicle to be driven or charged before data appears.\n Payment issues\n For subscription payment problems:\n Update your payment method in Account Settings\n Check that your card hasn't expired\n Verify with your bank that charges aren't being blocked\n Still need help?\n We're here to help. Reach out and we'll get back to you as soon as possible.\n Contact Support\n This action cannot be undone.\n Cancel\n Confirm",
  "crawledAt": "2026-02-15T20:32:37.899Z"
}