{
  "url": "https://riviantrackr.com/news/whats-coming-in-rivian-software-2026-03",
  "path": "/news/whats-coming-in-rivian-software-2026-03",
  "title": "What’s Coming In Rivian Software 2026.03",
  "text": "Skip to content\nRead the full release notes here for 2026.03\nRivian’s first software update for 2026 is coming for both Gen 1 and Gen 2 R1 vehicles. This update focuses on cold weather transparency, expanded performance features, smarter usability, and smoother visuals powered by Unreal Engine 5.5. Here is a clean breakdown by generation.\nGen 2 R1T and R1S\nCold Weather Improvements\nBlue battery shading shows temporarily unavailable energy\nProactive notifications when cold weather impacts range\nIn app guidance to help recover range and optimize winter driving\nImproved charging logic to better prepare the battery for your next drive  \nDrive Modes and Performance\nLaunch mode added to Performance Dual Motor, with 0 to 60 and quarter mile stats\nSport mode now available across all Dual Motor variants\nSport mode adds Standard ride height, plus Firm and Moderate ride feel options\nRock Crawl top speed increased to 33 mph for Quad and Tri Motor\nAbility to adjust drive modes, ride height, ride feel, and brake regen while Adaptive Cruise Control and Universal Hands Free are active  \nEnhanced Kneel Mode\nLowers further for easier entry and loading\nCan kneel from High ride height\nWorks across all on road drive modes\nOn demand activation under 20 mph via Quick Controls  \nSoftware and Interface\nUpgraded to Unreal Engine 5.5 for smoother animations and improved rendering\nBetter visualization of surrounding vehicles and pedestrians in Autonomy view\nUniversal Hands Free refinements and infotainment fixes\nGeneral stability and performance improvements  \nGen 1 R1T and R1S\nCold Weather Improvements\nBlue battery shading and improved visibility into range loss\nProactive notifications and in app winter driving guidance\nImproved battery preparation and charging logic  \nDrive Modes and Performance\nLaunch mode added to Performance Dual and Quad Motor\nSport mode now available across Dual Motor variants\nExpanded ride height and ride feel settings in Sport mode\nRock Crawl top speed increased to 33 mph for Quad Motor\nAbility to adjust on road drive modes and settings while Adaptive Cruise Control and Highway Assist are engaged  \nEnhanced Kneel Mode\nLowers further for easier access\nAvailable from High ride height\nOn demand activation under 20 mph through Quick Controls  \nSoftware and Interface\nUnreal Engine 5.5 upgrade for smoother display visuals\nImproved driver assistance rendering\nInfotainment bug fixes and stability enhancements  \nAcross both generations\nNew Apple Watch companion app for remote lock and unlock\nVent windows, sound alarm, adjust cabin temperature\nSet target state of charge directly from your wrist    \n 18 Comments \n So if all dual motor’s are getting sport mode, does that mean they get the performance upgrade as well. For those of us that bought the “max performance” the only difference would be the max performance get launch control…\n You still get the following:\n– 0-60mph in 3.4s\n– increased torque\n– increased hp\n– soft sand mode\n– rally mode\n and, you know, two more motors.\n The Performance Upgrade is still a dual motor, not a quad.\n Based on the fact that they are still offering a performance mode for increased acceleration and advertising 0-60 of 4.5 without the upgrade, I would assume the sport mode just forces the rear motor to be engaged all the time and probably changed the accelerator pedal mapping a bit.\n I’m replying as a Dual Motor NON-performance owner…\nMy suspicion is this “Sport Mode” will not enhance maximum power or torque. However, I think it will likely change how that power is delivered. My biggest complaint with the dual motor base is you don’t have access to the power you paid for right when you ask for it. It’s almost like having the “Snow” button pressed on. The best way I can explain that is from a stop, with traction control off….my 533hp and 610tq truck cannot spin a single tire. Rivian CLEARLY has neutered the throttle mapping on the dual motors to a point it’s kinda garbage to be honest. I think they did this to create a wider performance gap to the Performance Dual Motor version.\nBut now with the R2 on the horizon, someone in Rivian marketing likely pointed out we’ll have the baby SUV posting performance numbers that walk all over the higher priced R1 (which wouldn’t make people happy who paid big $$$). Giving the dual motor vehicles more immediate access to power (without raising max power) would help fill that gap. That’s what I think is happening.\n CarPlay would be great Rivian. \nIt’s not about your apps being better. It’s about accessing my phone and the info on it in a first class manner. \nHopefully Tesla will force Rivian’s hand.\n Rivian showing love for Gen 1 owners :).. Thanks for the early preview Jose!\n When? Is it rolling out now while it is cold?\n Usually about a week after the beta is released to the employees it will hit the public.\n So with the upcoming Feb 12 briefing for the 4Q/full-2025, they are teasing the R2 pre-launch. And as part of R2, they need to have all the “basic functionality” in place, of which UHF was one piece. The last remaining big missing puzzle piece is the Gemini assistant (their response to Carplay/AA). I assumed it would be in this release. Now, they have in the past done last-second reveals of new functionality just as the release is going out. And Jose, who has the inside track, uses the phrase “smarter usability” in his intro. Of course Jose is sworn to secrecy, so we will see…\nWhile the Gemini assistant is bound to be massively complicated, since it is fundamentally connected to all aspects of the car’s drive and infotainment systems, it is also not safety-critical (like UFH). So it is one of those features that could come out early, and use us as beta testers. While lots will complain if it is not perfect, I think so many of us would be relieved enough to have some progress on this front, that we would happily beta test (myself included). So let’s see it, Rivian.\n For me lack of voice texting is a real fail. Tesla has been doing this forever. Also Alexa is not ideal, I would much prefer google.\n Agree on the voice texting, but they have already told us that Google is coming and that texting is part of that.\n It’s nice to see that Rivian is still supporting us early Gen1 adopters. I still love driving my R1T!\nSide note (pun intended): I really wish Rivian would allow the side mirror flood lights to operate in off-road modes. I understand that many states limit the use of more than four projection lights on public highways, but enabling this feature off-road would be incredibly helpful for trail driving and locating campsites at night. While aftermarket options exist, it would be great to use a capability that Rivian’s designers clearly built into the vehicle from the start—without needing additional bolt-ons.\n I completely agree with this! A feature I would love!!\n Sport Mode is coming to Dual motor Rivians. Does that mean they will also give the performance boost to all dual motor gen1 owners? A bit confused about what Sport Mode will do foe gen1 owners who have dual motors. \nAnd for the Apple Watch App, does that mean even for gen1 owners, the watch will act like a key and we won’t have to have our phones to start the car?\n still no rear seat belt warning for gen 1…\n It’s been 2 months since the last software release. Are there any updates to autonomous driving?\n Leave a ReplyCancel ReplyYour email address will not be published. Required fields are marked *\n Name  *\n Email  *\n Add Comment *\n Save my name and email in this browser for the next time I comment.Post Comment \nΔ",
  "crawledAt": "2026-02-19T03:38:38.170Z"
}