{
  "url": "https://riviantrackr.com/news/rivian-reveals-usable-battery-capacity-for-gen-2-vehicles",
  "path": "/news/rivian-reveals-usable-battery-capacity-for-gen-2-vehicles",
  "title": "Rivian Reveals Usable Battery Capacity for Gen 2 Vehicles",
  "text": "Skip to content\nWhen it comes to electric vehicles, one of the most crucial specifications for any buyer is the battery capacity. It determines not just how far the vehicle can travel on a single charge, but also how efficiently it can support other energy-consuming systems like heating and air conditioning. Recently, Rivian officially shared the usable capacity of their Gen 2 battery packs, offering deeper insight into what drivers can expect.\nWhat Does “Usable Capacity” Mean?\nBefore diving into the numbers, it’s essential to understand what “usable capacity” actually refers to. An electric vehicle’s battery has a total capacity, but not all of it is available for vehicle propulsion or cabin comfort. Usable capacity is the portion of the battery that is dedicated to driving and running essential systems such as heating, air conditioning, and other features that draw on power.\nGen 2 Vehicles\nRivian has unveiled the usable capacities for the three available battery packs:\nStandard Pack: 92.5 kWh\nLarge Pack: 108.5 kWh\nMax Pack: 140 kWh\nThe Gen 2 Standard Pack comes in at 92.5 kWh, which provides ample power for everyday driving, though it’s tailored for drivers who prioritize efficiency over range. The Large Pack increases that figure to 108.5 kWh, offering a balanced option for those who want a bit more range without going overboard. Finally, the Max Pack delivers an impressive 140 kWh of usable capacity, designed for drivers who need the maximum possible range and power for longer trips and heavier loads.\nGen 1 Vehicles\nFor comparison, here are the usable capacities of their first-generation battery packs, which many current Rivian owners are already familiar with:\nStandard Pack: 106 kWh\nStandard+ Pack: 121 kWh\nLarge Pack: 131 kWh\nMax Pack: 141 kWh\nCompared to the newer Gen 2 packs, the Gen 1 packs offer slightly higher usable capacities in some configurations. The Standard Pack from Gen 1 vehicles starts at 106 kWh, higher than the Gen 2 equivalent, while the Max Pack comes in at 141 kWh, just 1 kWh above the Gen 2 Max Pack.\nWhat Do These Differences Mean?\nWhile the Gen 2 Standard and Large Packs have slightly smaller capacities than their Gen 1 counterparts, advancements in battery management and vehicle efficiency could mean that real-world range differences are minimal. In contrast, the Gen 2 Max Pack still offers nearly the same enormous usable capacity as the Gen 1 Max Pack, maintaining Rivian’s reputation for long-range capabilities.\nSource: Reddit\n One comment \n My gen 2 max pack is working great, but why isn’t my gen 2 Halloween mode working even after the .31 update?!\n Leave a ReplyCancel ReplyYour email address will not be published. Required fields are marked *\n Name  *\n Email  *\n Add Comment *\n Save my name and email in this browser for the next time I comment.Post Comment \nΔ",
  "crawledAt": "2026-02-19T03:37:23.704Z"
}