{
  "url": "https://www.rivianroamer.com/privacy-policy",
  "path": "/privacy-policy",
  "title": "Rivian Roamer",
  "text": "Privacy Policy for Rivian Roamer\n Effective Date: 2025/07/22\n Our Commitment to Your Privacy\n We do not sell, rent, or share your personal information with third parties. Period. Your privacy is fundamental to our service.\n What We Collect\n Your Info: Email, name, and linked Rivian account details\n Payment Status: Subscription status and billing email (we NEVER store credit cards - Stripe handles all payments)\n Usage Data: How you use our site, browser info, and device type\n Important: We NEVER store your Rivian password. We use secure tokens that must be reviewed every 6 months.\n Vehicle & Telematics Data\n We collect vehicle data through Rivian's API including location, battery status, and driving statistics\n This data is stored securely and never shared with third parties\n Location data is only used for the features you enable\n You can delete your vehicle data at any time through your account settings\n How We Use Your Data\n We use your information to:\n Provide and improve our service\n Send important updates\n Handle customer support\n Keep everything secure\n Your Rights\n You can:\n Access your personal data\n Correct any mistakes\n Delete your account and data\n Export your information\n Opt out of any communications\n Just email us at support@rivianroamer.com to exercise these rights.\n Security & Storage\n We use encryption for all data\n Analytics data kept for 1 year\n Personal data kept while you're a user or until you delete it\n We'll notify you if there's ever a data breach\n Third-Party Services We Use\n Stripe: Payment processing (they handle all credit card data securely)\n Analytics: Basic usage statistics (no personal data shared)\n Cloud Infrastructure: Secure data storage providers\n These services have their own privacy policies and security measures\n California Residents\n Under the California Consumer Privacy Act (CCPA), you have additional rights including:\n The right to know what personal information we collect\n The right to delete your personal information\n The right to opt-out of data sales (we don't sell your data anyway)\n The right to non-discrimination for exercising your privacy rights\n Other Important Stuff\n We use cookies to make the site work better and remember your preferences\n Not for kids under 13\n By using our service, you agree to this policy\n We'll update this policy on this page if things change\n Data may be processed in the United States\n Contact Us\n Questions? Email: support@rivianroamer.com\n Operated by Velocity Studios, LLC\n This action cannot be undone.\n Cancel\n Confirm",
  "crawledAt": "2026-02-19T03:39:16.308Z"
}