{
  "url": "https://riviantrackr.com/news/rivian-confirms-lfp-battery-calibration-issue-persists-months-after-initial-owner-reports",
  "path": "/news/rivian-confirms-lfp-battery-calibration-issue-persists-months-after-initial-owner-reports",
  "title": "Rivian Confirms LFP Battery Calibration Issue Persists Months After Initial Owner Reports",
  "text": "Skip to content\nThe LFP battery range calibration issue affecting Gen 2 R1 Dual Standard vehicles is still lingering months after it was first acknowledged by Rivian.\nThis issue was originally flagged in November 2025, when Rivian began reaching out to Gen 2 R1 Dual Standard owners equipped with the LFP battery with a similar message about incomplete battery calibration and inaccurate range estimates. At the time, owners were advised to charge to 100% regularly to allow the system to properly recalibrate.\nNow, months later, Rivian is once again contacting many of those same owners with nearly identical guidance, suggesting the problem has not been fully resolved across the fleet.\nIn the latest outreach, Rivian Engineering states that affected vehicles have not yet completed a required battery calibration process that is essential for accurate range estimates. Owners are instructed to charge their vehicles to 100% every two days, or as often as possible, over the next several weeks. Rivian notes that calibration improves incrementally with each full charge.\nTo minimize the most noticeable effects of the issue, Rivian recommends keeping the battery above 20% whenever possible. Owners will receive a follow-up text once calibration is fully complete.\nWhat stands out this time is that many of the vehicles receiving this message are already running Rivian’s latest software update, version 2025.46.30. That detail reinforces that this is not simply a software bug that can be fixed with an over-the-air update, but rather a calibration process that requires repeated real-world charging behavior.\nThe issue appears limited to Gen 2 R1 Dual Standard vehicles using the LFP battery chemistry, with no indication so far that other trims or battery packs are impacted. Still, the fact that owners are being reminded months later raises questions about how long full calibration takes and how consistently it is completing under normal driving and charging habits.\nFor owners seeing sudden range drops or wildly inaccurate estimates, Rivian’s continued outreach suggests the issue is calibration-related rather than actual battery degradation. Rivian is encouraging affected owners to contact support directly if they have questions as the company continues working through the issue.\nFor now, the guidance remains the same as it did back in November: frequent 100% charges, keeping the battery above 20% , and waiting for confirmation that calibration has finally completed. \nThanks to Ian for sending this over and helping flag that this issue is still actively impacting owners.\n 3 Comments \n Interesting you just posted this as I received confirmation my R1T has successfully completed calibration.\nText from Rivian on January 15th 2026\n“The Rivian Engineering team has determined that your vehicle has successfully completed calibration and the estimated range will display as expected. You may resume normal driving and charging behavior.”\n Fantastic news! I’m glad they are reaching out when calibration is complete.\n I got the text yesterday telling me the calibration wasn’t complete. I’ll start charging to 100% every day until I get the calibration complete text, I guess. I charged it to 100% at least 6 times after getting the first text though.\n Leave a ReplyCancel ReplyYour email address will not be published. Required fields are marked *\n Name  *\n Email  *\n Add Comment *\n Save my name and email in this browser for the next time I comment.Post Comment \nΔ",
  "crawledAt": "2026-02-19T03:37:43.594Z"
}