{
  "url": "https://riviantrackr.com/news/rivian-r2-dual-motor-awd-launches-this-spring-full-details-coming-march-12",
  "path": "/news/rivian-r2-dual-motor-awd-launches-this-spring-full-details-coming-march-12",
  "title": "Rivian R2 Dual Motor AWD Launches This Spring, Full Details Coming March 12",
  "text": "Skip to content\nRivian has officially confirmed that the first R2 variant, a dual-motor all wheel drive configuration, will launch this spring. And more importantly, we now have a date for the full reveal which will be on March 12, 2026. Pricing, options, and all the details we’ve been waiting for will finally be on the table.\nAfter weeks of validation drive impressions and carefully controlled previews, this is the moment where speculation turns into numbers. We already know R2 is aimed at the heart of the high volume EV market, and leading with a dual-motor AWD variant makes a lot of sense. It keeps the brand’s adventure DNA intact while still positioning R2 as the more accessible entry point into Rivian ownership.\nWhat makes this interesting is the timing. Rivian is clearly building momentum. First, media gets behind the wheel of validation builds. Now, an official launch window and a firm date for pricing and configuration details. And it hasn’t gone above my head that the timing is during SXSW where Rivian has already confirmed R2 will play a huge role.\nMarch 12 will tell us everything that truly matters, how Rivian plans to price it, how they’ll structure trims and options, and how aggressively they want to compete in the segment that has long been dominated by the Model Y. If Rivian threads the needle on price and range while keeping that unmistakable Rivian feel, R2 could quickly become the company’s most important vehicle.\nFour weeks and two days. Not that anyone’s counting.\n 6 Comments \n Price point for the 2026 R2 dual vehicle???\n RTFA\n Will there be a launch edition for the Version 2 (LiDAR + New Rivian Chip) R2 in latter part of 2026?\n Model Y and R2 are completely different vehicles. R2 is a SUV. Lots of interior room and good driver visibility and good ground clearance. Model Y is a jelly bean sedan with a hatchback. Limited interior room, poor driver visibility and terrible ground clearance. People want mid sized SUVs. Huge market. Rivian will likely eventually dominate the EV market in North America and Europe. Such a smart company.\n Rivian has the potential to swamp the Tesla Model Y with the R2. If it lives up to the expectations i can see it as a major success for the company. It is the perfect medium SUV for the US market\n Will they announce who will get opportunity to purchase first/ease from the list of those registered. How will they contact those people? How many, etc? Do we really anticipate if youre at the bottom of the list having to wait more than 1 year?\n Leave a ReplyCancel ReplyYour email address will not be published. Required fields are marked *\n Name  *\n Email  *\n Add Comment *\n Save my name and email in this browser for the next time I comment.Post Comment \nΔ",
  "crawledAt": "2026-02-19T03:37:33.736Z"
}