{
  "url": "https://riviantrackr.com/news/tesla-just-gave-up-on-drivers-and-handed-rivian-an-opening",
  "path": "/news/tesla-just-gave-up-on-drivers-and-handed-rivian-an-opening",
  "title": "Tesla Just Gave Up on Drivers and Handed Rivian an Opening",
  "text": "Skip to content\nTesla officially pulling the plug on the Model S and Model X feels like the most on brand move possible right now. For years, Tesla has been telling anyone who will listen that the future is autonomy first, vehicles second. Yesterday just made that philosophy impossible to ignore.\nElon Musk has been very clear about where he wants Tesla to go. Full Self Driving Unsupervised, Robotaxi, humanoid robots, AI as the core product. In that world, legacy products like the Model S and Model X are distractions. They are vehicles built for people who enjoy driving, or at least want the option to. That no longer seems to be the customer Tesla is optimizing for.\nFrom a business standpoint, it makes sense. Tesla sees more upside in software margins, data, and autonomy platforms than in selling premium enthusiast vehicles at relatively low volume. But there is a massive assumption baked into that strategy, that most people actually want to stop driving altogether.\nPlenty of people do. Commuters stuck in traffic, rideshare users, fleets, parents shuttling kids around town. Autonomy is a genuine win for them. But there is another group that keeps getting ignored in these conversations, people who actually like driving.\nThey like steering feel. They like power delivery. They like choosing a line on a mountain road or feeling a vehicle respond exactly how they expect. For them, driving is not a chore to eliminate, it is part of the experience they paid for.\nAnd yes, I already know this part of the conversation is going to trigger some folks who read my content and are all in on autonomy and Robotaxi. That is fine. This is not anti-autonomy. It is not dismissing the progress or the importance of what Tesla is building. It is simply acknowledging that enthusiasm for autonomy is not universal, and pretending it is does not make it true.\nYou can believe Robotaxi is the future and still recognize that a lot of people want control, at least some of the time. The two ideas are not mutually exclusive, even if the loudest voices online tend to frame them that way.\nBy stepping away from that audience, Tesla is leaving a vacuum, and that vacuum will get filled.\nThis is where companies like Rivian have a real opportunity. Rivian talks about software, autonomy, and future tech, but it still builds vehicles that assume a human is behind the wheel and actually wants to be there. Steering tuning, suspension behavior, drive modes, and physical controls still matter.\nRivian is not alone here either. Porsche, BMW, even some legacy OEMs are quietly doubling down on the idea that autonomy can coexist with driver engagement. You can have advanced driver assistance without erasing the joy of driving altogether.\nTesla walking away from the Model S and X is not just a product decision. It is a signal. Tesla is no longer trying to be the best car company for people who love cars. It wants to be the most important autonomy and robotics company in the world.\nThat is fine. But it creates space for others to say, we still build vehicles for people who want to drive.\nIn the long run, the market does not have to choose one or the other. Autonomy will win in some segments. Driving passion will survive in others. The mistake would be assuming one eliminates the need for the other.\nTesla just made its choice very clear. Now it is up to everyone else to decide how to take advantage of what was left behind.\n 13 Comments \n I agree.\nI wonder how many of those buyers will be heading to Rivian\n No offense, but I think saying that Tesla abandoning the market of people who want to drive is silly. More or less, at this point, all they’ve done is eliminate redundancy. The differences between the S and 3, and the X and Y, were some extra premium features, and much higher prices. I don’t see Tesla abandoning selling vehicles anytime soon, and their current models are definitely drivable. 🙂\nI think the only companies to benefit from these models being eliminated are those that specialize in expensive vehicles with all the bells and whistles. I think Rivian’s strength will be when the R2 and R3 get produced and Rivian can start selling those in mass quantities, but the Model Y and Model 3 are their main competition here, not the Model X and Model S.\n Long term though, I could see this scenario, as Tesla wants their future to be in autonomy, but I think it will be a good amount of time before that opportunity opens up.\n Paul B I assume you have never driven any of the Tesla models if you think there are only small differences. There are huge luxury differences between them. Saying an X and Y are the same is like saying a Kia and a BMW are the same. My husband drives an at and I drive a Y and they are very very different. The Y is very cheap inside and outside in compassion. From luxury leather to loud road sound. There are very big differences. So you sir are the silly one for thinking they are at all the same. What Tesla just did was lower themselves to the same class as KIa and Hyundai instead of having a luxury version like an Acura or a Lexus. I am truly disappointed.\n I own a 2022 Model Y, and have ridden in a 2026 Model Y. I have not been in an X to compare. From what I hear from other Tesla owners, the latest Juniper Model Y is much nicer, and I’ve heard it said that it makes the Model X less worthy of the higher price with new features they’ve added to the latest Juniper Model Y. I really enjoy my Model Y, and I’ve never thought of it as cheap (that outside paint though, not great!). I know the X and Y are not the same, but from what I hear, they are closer in comparison than what they once were. I do understand your point though of comparing them to other brands and no longer having luxury versions of their vehicles. If that is what you wanted, it is disappointing it is no longer offered.\n It seems like a smart business decision based on the number of units sold. I believe I’ve seen from several sources that Tesla has only produced around the 50K mark of ‘other vehicles’ (presumably the S, X, Cybertruck and Semi) which were not the 3 or Y and accounted for over 1.5 million produced. The cost to produce the vehicles (staffing, equipment, parts inventory, etc.) doesn’t really seem worth it anymore with the popularity of the 3 and Y. Sure they are nice cars, but a huge majority of people are only looking at the 3 and Y if they are buying a Tesla or any electric car for that matter. Who knows, maybe Rivian will do the same thing in the future once the R2 and R3 models become hugely popular and dominate sales.\n Elon’s singular focus will come back to bite him. Also, can’t discount the fact that sales have declined substantially and looking forward, with ageing models, it looks even more grim. So yes its a pivot, but it’s also a symptom of a troubled consumer brand.\n Buyers for the Model S now have vehicles like the Taycan/Etron GT to pick from. The R1S or Ioniq 9 are a better three row option than the X with the R1S being the top selling lux 3 row in CA.\n I’ve had a model X – its a mechanical nightmare when things go wrong and a big source of service overhead for Tesla, they are stopping the bleeding. Falcon wing doors are not a cool look when you are bending underneath them to get it because they can’t open all the way. Smart business move getting rid of it, but definitely opens up for Rivian R1S to eat their lunch on the luxury 3-row SUV market. Whats the alternative – a volvo EX? Gag. A kia EV9? Vomit. The only danger (and it is a real danger) to the Rivian R1S is going to be the model Y-L – if Tesla brings that to the US market Rivian R1S is going to have its work cut out for it.\n Robotaxis seem like a great partial solution for urban areas. For those of us in rural areas, I don’t see it except on a very limited basis.\n Rivian just needs to get the software piece together to compete with Tesla and bring people over. As a previous Tesla owner, I’m consistently missing features that my Tesla had. And when I see feature update announcements for Tesla, I truly miss my Tesla. Rivian can do it but they really need to start iterating faster.\n I agree, but they mostly lost me on their autopilot. Unfortunately for Rivian I just found out about the new Subarus so I am comparison shopping an R2.\n I think discontinuing the Model S and X is a sound business decision for a company prioritizing autonomy and robotics. The portion of the Fremont plant dedicated to S and X production is underutilized. At the same time, Fremont cannot realistically produce Optimus alongside vehicles at full capacity, since robots and cars require fundamentally different production lines. Building a separate factory solely for Optimus would likely concern investors while several existing plants (Fremont, Texas, Germany) remain underutilized. It’s possible this decision was made over a year ago and has only now been formally announced.\n Leave a ReplyCancel ReplyYour email address will not be published. Required fields are marked *\n Name  *\n Email  *\n Add Comment *\n Save my name and email in this browser for the next time I comment.Post Comment \nΔ",
  "crawledAt": "2026-02-19T03:38:34.146Z"
}