{
  "url": "https://www.rivianroamer.com/software-updates/2025-34",
  "path": "/software-updates/2025-34",
  "title": "Rivian Software Update 2025.34 | Rivian Roamer",
  "text": "Rivian Software Update \n 2025.34\n Energy Unlocked\n Released September 25, 2025\n Get notified before Rivian tells you\n Join 6,200+ Roamers getting early alerts by linking your Rivian account - it's free!\n Join and Connect\n Release Notes\n Gen 1 R1S\n •\n Gen 1 R1T\n •\n Gen 2 R1S\n •\n Gen 2 R1T\n •\n RivianTrackr\n Enhanced Highway Assist Improvements (Gen 2)The new Co-Steer feature allows you to adjust your position within a lane using gentle steering inputs while Highway Assist is active without the system disengaging. Co-Steer enables you to make adjustments within the lane in certain situations, like driving beside barriers or passing a semi-truck in an adjacent lane. This feature provides you with collaborative steering while using Highway Assist.The availability of Enhanced Highway Assist has increased by up to 50%, particularly on urban and suburban highways.Introduced a new perception model that improves lane centering performance, especially in moderate to tight curves.Smart Charging Schedule RecommendationYour Rivian can now automatically charge at home during off-peak times when electricity is typically cheaper, cleaner, and more reliable, while still ensuring your vehicle is ready when you need it. This smart scheduling can cut annual home charging costs by 20% or more and increase your use of clean energy. Enable this feature for effortless savings, reduced emissions, and a better balance for the grid, all handled seamlessly through your Rivian mobile app (version 3.5 or later).Enhanced Audio SettingsTo optimize your listening experience, you can now save custom versions of each equalizer profile. Plus, we've added two additional custom slots that you can also rename.Additional ImprovementsAudio Improvements (Gen 2)Fine-tuned equalization and delays to make the bass feel richer and more impactful.Soundstage improvements for better localization, separation, and layering.Improved blending of Dolby Atmos® content for all listening positions.Performance ImprovementsUpdated and improved media apps, including increased touchscreen responsiveness.Improved Navigation stability and responsiveness.Improved responsiveness to mobile commands while vehicle is asleep.Resolved a rare issue that prevented users from accepting the terms of service for Rivian Navigation with Google Maps.Fixed an issue that kept Gear Guard video thumbnails from displaying properly on the Motion Cam and Incidents screens.Resolved a rare issue where the tonneau cover position was displayed incorrectly on certain screens. (Gen 1, R1T)Resolved a rare issue that caused fog lights to turn off and exterior lighting to revert to Auto mode. (Gen 1)Fixed an issue that caused trip energy and efficiency data to fluctuate unexpectedly.Made improvements to the accuracy of battery range on arrival estimates, including adding location air density as a factor for locations at higherelevations.Resolved a rare issue that prevented the door handles from presenting for an unlock request while Car Wash mode is active. (Gen 2)Reduced excessive blower noise during climate control start-up in mild conditions while maintaining cooling performance in extreme temperatures. (Gen 2)Fixed a rare issue that caused cabin conditioning requests initiated from the Rivian mobile app to fail on the first attempt. (Gen 2)Introduced additional improvements for 12 V battery health detection, including in-vehicle and mobile app notifications to alert you when the 12 V battery needs to be replaced. (Gen 2)\n Build Versions\n Platform-specific builds for each generation\n Gen 1\n 2021-2024\n 2025.34.01\n 1bb94b6\n Released September 24, 2025\n Notes\n Gen 2\n 2025+\n 2025.34.30\n ccc7fa0\n Released September 24, 2025\n Notes\n This action cannot be undone.\n Cancel\n Confirm",
  "crawledAt": "2026-02-19T03:41:05.233Z"
}