{
  "url": "https://www.riviantrackr.com/2026-03",
  "path": "/2026-03",
  "title": "Rivian Software Update 2026.03",
  "text": "Skip to content\nGen 1(2021-2024)Gen 2(2025-2026)Gen 1(2021-2024)Gen 2(2025-2026)\nCold Weather Improvements\nWe have made several improvements to give you better visibility into how cold weather can affect your vehicle range and what you can do to manage it.\nThe vehicle and the Rivian mobile app now let you know when, and by how much, your range is affected by cold weather.\nThe driver display, Energy app, and Rivian mobile app include a battery graphic that uses blue shading to indicate how much energy is temporarily unavailable.\nThe vehicle and the Rivian mobile app provide preemptive notifications when your vehicle is most susceptible to range loss and when your range has reduced due to battery becoming cold.\nWhen your range is impacted or may become impacted, you can open a guide in the Rivian mobile app which provides insight on improving your experience in cold weather. It includes information on how to recover range due to cold and other useful tips, like scheduling your drive, using Snow mode, and conditioning the cabin before driving. You can also access the guide in the support articles at rivian.com/support.\nWe improved charging logic to better prepare the battery pack for your next drive and help recover energy more predictably.\nNOTE: Cold-weather and range loss notifications require version 3.9 or later of the Rivian mobile app.\nApple Watch App\nThe latest Rivian mobile app update includes a companion app for your Apple Watch. This allows you to remotely access and control your vehicle from your Apple Watch. Access to your vehicle is easy: you can lock or unlock your vehicle with a tap of the Lock icon. With the app open, you can start to drive.\nNOTE: You must foreground the Apple Watch app to ensure that your Apple Watch can be used as a key for your Rivian vehicle.\nYou can also use the Apple Watch app to lock or unlock your doors, vent your windows, or sound the alarm, all within a simple tap of your wrist. For even more control, use the Digital Crown to set a target state of charge or adjust the cabin temperature. Additionally, the app’s customizable design lets you choose up to four quick controls for instant access to the features you use most. Go to the Owner’s Guide on the center display for more information about all the Apple Watch has to offer.\nNOTE: The Apple Watch app requires version 3.9 or later of the Rivian mobile app.\nExciting New Updates for Drive Modes\nWe further enhanced the driving experience:\nPerformance Dual-Motor and Quad-Motor now offer Launch mode, which is designed for use on a closed circuit track in dry road conditions and provides racing states for 0-to-60 mph (0-to-100 km/h) and quarter-mile race times, along with visualizations and driver coaching. Go to Driver Modes and choose Sport mode on the center display. Then choose Launch mode and follow the on-screen instructions. For more information and important warnings, go to the Owner’s Guide and search for Launch mode.\nSport mode is now available on all Dual-Motor variants. Sport mode prioritizes on-road vehicle performance and optimizes responsiveness and handling in all-wheel drive.\nSport mode now offers Standard ride height.\nSport mode now offers Firm and Moderate ride feel settings to more accurately reflect the vehicle’s performance.\nFor Quad-Motor, we have increased the top speed in Rock Crawl mode to 33 mph (53 km/h) to enable more usability between obstacles on trail.\nYou can now change between all on-road drive modes and adjust ride height, ride feel, and brake regeneration settings while Adaptive Cruise Control and Highway Assist are engaged.\nEnhanced Kneel Mode\nGetting in and out of your vehicle just got a whole lot smoother. We’ve redesigned Kneel Mode to be more responsive, more accessible, and available exactly when you need it.\nYour vehicle will now lower even further in Kneel Mode, making it easier than ever to enter, exit, or load gear.\nWe’ve re-engineered our algorithms so your vehicle can now kneel from High ride height and across all on-road drive modes, including All-Purpose, Sport, Conserve, and Snow.\nYou can now trigger Kneel Mode on demand via a new Quick Control option to activate the lowering process while traveling at low speeds, less than 20 mph (32 km/h).\nIf Kneel Mode isn’t available due to specific conditions, we’ll let you know whey. If the Kneel icon is greyed out in your Quick Controls, simply choose it to learn more about why Kneel is unavailable.\nThanks, Cambry, for the feedback!\nUnreal Engine 5 Upgrade\nWe upgraded our software to use Unreal Engine 5.5 for the three-dimensional renderings s how on the driver and center displays, including the Driver Assistance view and apps such as Drive Modes and Settings. Improvements include better anti-aliasing, smoother animations, and increased capability to render a larger number of surrounding vehicles, bicycles, and pedestrians on the driver display.\nAdditional Improvements\nFlorida Power & Light FPL Evolution charging locations with real-time status and speed information now appear in maps and navigation.\nInfotainment\nFixed an issue that caused the FM radio to be stuck in a reconnecting state.\nAddressed several display and layout issues on the Drive Modes Gauges view.\nFixed an issue that caused the infotainment system to crash when you swiped on the Drive Modes screen.\nGeneral stability and performance enhancements.\nCold Weather Improvements\nWe have made several improvements to give you better visibility into how cold weather can affect your vehicle range and what you can do to manage it.\nThe vehicle and the Rivian mobile app now let you know when, and by how much, your range is affected by cold weather.\nThe driver display, Energy app, and Rivian mobile app include a battery graphic that uses blue shading to indicate how much energy is temporarily unavailable.\nThe vehicle and the Rivian mobile app provide preemptive notifications when your vehicle is most susceptible to range loss and when your range has reduced due to battery becoming cold.\nWhen your range is impacted or may become impacted, you can open a guide in the Rivian mobile app which provides insight on improving your experience in cold weather. It includes information on how to recover range due to cold and other useful tips, like scheduling your drive, using Snow mode, and conditioning the cabin before driving. You can also access the guide in the support articles at rivian.com/support.\nWe improved charging logic to better prepare the battery pack for your next drive and help recover energy more predictably.\nNOTE: Cold-weather and range loss notifications require version 3.9 or later of the Rivian mobile app.\nApple Watch App\nThe latest Rivian mobile app update includes a companion app for your Apple Watch. This allows you to remotely access and control your vehicle from your Apple Watch. Access your vehicle is easy: passive entry is automatically enabled if your digital key is set up. Walk up to your vehicle, and it automatically unlocks as you approach. Then you can start to drive.\nYou can also use the Apple Watch app to lock or unlock your doors, vent your windows, or sound the alarm, all within a simple tap of your wrist. For even more control, use the Digital Crown to set a target state of charge or adjust the cabin temperature. Additionally, the app’s customizable design lets you choose up to four quick controls for instant access to the features you use most. Go to the Owner’s Guide on the center display for more information about all the Apple Watch has to offer.\nNOTE: The Apple Watch app requires version 3.9 or later of the Rivian mobile app.\nExciting New Updates for Drive Modes\nWe further enhanced the driving experience:\nPerformance Dual-Motor now offers Launch mode, which is designed for use on a closed circuit track in dry road conditions and provides racing states for 0-to-60 mph (0-to-100 km/h) and quarter-mile race times, along with visualizations and driver coaching. Go to Driver Modes and choose Sport mode on the center display. Then choose Launch mode and follow the on-screen instructions. For more information and important warnings, go to the Owner’s Guide and search for Launch mode.\nSport mode is now available on all Dual-Motor variants. Sport mode prioritizes on-road vehicle performance and optimizes responsiveness and handling in all-wheel drive.\nSport mode now offers Standard ride height.\nSport mode now offers Firm and Moderate ride feel settings to more accurately reflect the vehicle’s performance.\nFor Quad- and Tri-Motor, we have increased the top speed in Rock Crawl mode to 33 mph (53 km/h) to enable more usability between obstacles on trail.\nYou can now change between all on-road drive modes and adjust ride height, ride feel, and brake regeneration settings while Adaptive Cruise Control and Universal Hands-Free are engaged.\nEnhanced Kneel Mode\nGetting in and out of your vehicle just got a whole lot smoother. We’ve redesigned Kneel Mode to be more responsive, more accessible, and available exactly when you need it.\nYour vehicle will now lower even further in Kneel Mode, making it easier than ever to enter, exit, or load gear.\nWe’ve re-engineered our algorithms so your vehicle can now kneel from High ride height and across all on-road drive modes, including All-Purpose, Sport, Conserve, and Snow.\nYou can now trigger Kneel Mode on demand via a new Quick Control option to activate the lowering process while traveling at low speeds, less than 20 mph (32 km/h).\nIf Kneel Mode isn’t available due to specific conditions, we’ll let you know whey. If the Kneel icon is greyed out in your Quick Controls, simply choose it to learn more about why Kneel is unavailable.\nThanks, Cambry, for the feedback!\nUnreal Engine 5 Upgrade\nWe upgraded our software to use Unreal Engine 5.5 for the three-dimensional renderings s how on the driver and center displays, including the Driver Assistance view and apps such as Drive Modes and Settings. Improvements include better anti-aliasing, smoother animations, and increased capability to render a larger number of surrounding vehicles, bicycles, and pedestrians on the driver display.\nAdditional Improvements\nFixed an issue that caused Universal Hands-Free to issue take over requests when approaching toll gantries.\nFind an issue that caused Universal Hands-Free to not automatically re-engage after a manual lane change.\nAdvanced the timing of notifications when approaching traffic lights and stop signs while Universal Hands-Free is active.\nUpdated notifications for Universal Hands-Free.\nFlorida Power & Light FPL Evolution charging locations with real-time status and speed information now appear in maps and navigation.\nInfotainment\nFixed an issue that caused the FM radio to be stuck in a reconnecting state.\nAddressed several display and layout issues on the Drive Modes Gauges view.\nFixed an issue that caused the infotainment system to crash when you swiped on the Drive Modes screen.\nGeneral stability and performance enhancements.\nFixed an issue that deployed door handles when the vehicle switched from Drive to Park when Car Wash mode is active.\nFixed an issue that kept rearview guidelines and camera buttons from appearing in live camera views on the center display.\n 21 Comments \n How much lower does it kneel?\nWould love to see a tuner mode for dual performance and tri-motor variants. At least an accelerator pedal curve adjustment would be nice.\n One would assume to lowest, since that’s only slightly lower than low and also the next and final position.\n Makes sense but was considering that it could potentially go lower than “lowest” since that’s used in performance mode while driving and this would be at slow to zero speed, which would could allow for more reduction in height.\n The one thing I’ve really been holding out for, is launch mode for my gen 1 quad. Thank you, Rivian! Thank you, assuming they raised the top speed limiter when in launch mode.\n You and I are cut from the same cloth. Been chomping at the bit for this since day 1. Although, w/o a high enough speed limiter it’s still going to be a disappointment. Honestly, that’s the bigger peeve. Watching a Porsche something or other suddenly start getting bigger in my mirror has been one of the worst moments of my life!\n What about the AI features they said were coming early 2026? For the past 4 years, all I’ve wanted was hands free text integration.\n What about the faulty mirroring? When my phone is connected and I try mirroring, I tap on Rivian and the name Rivian flashes but it never mirrors. Took it to the SC and was told it is a software issue.\n Lower kneel mode sounds great, but my 20s already rub on the fender when turning in kneel mode. I wonder if they will rub while going straight in a lower kneel mode.\n Same for me.\n Adding that my R1T takes a minute or so to come out of kneel mode when I am backing out of my long driveway. Thats when I get the rubbing.\nJose, Looking forward to your review of the new 2026. 03 OTA.\n Love an adjustment option to side mirror lowering on reverse to only lower on the sidewalk side so can still use street view for tracking oncoming vehicles. Is this possible using cameras and other sensors?\n Are you saying it would recognize the side of the vehicle the sidewalk is on and tilt only that mirror? I think , in the set up for the reversing mirror behavior, you can tell the operation to engage left and right or only one of the two for tilt in reverse (today). I have a Gen 1 quad for reference.\n Great updates. The digital key not opening, closing doors continues to be an issue. How about fixing the issue with new digital key not working in passive mode despite having iPhone 15+, deleting/ibstalling app; deleting key, reinstalling key; rebooting iPhone actions to no avail.\n What about a resume button for the cruise control? That’s been promised for several years.\n Hi. Is the 2026 R1S hardware capable of connecting to 5G? There is a Qualcomm video that says it is. Could 5G connectivity be added in a future software update?\n Is there an upcoming fix for approaching a stop light without a car in front of you? I find it annoying and possibly dangerous, due to forgetting that without a car in front of me, my Rivian will not stop at a stop light while in universal hand free driving.\n No. Pay attention.\n Will there be an update for my Rivian to automatically adjust either left or right when driving in universal handsfree, when the adjacent vehicles from either sides gets close to their driving line?\n update for my Rivian to automatically adjust either left or right when driving in universal handsfree, when the adjacent vehicles from either sides gets close to their driving line?\n Do you know if they plan on releasing the software update to the public this month?\n We should expect it next week.\n Leave a ReplyCancel ReplyYour email address will not be published. Required fields are marked *\n Name  *\n Email  *\n Add Comment *\n Save my name and email in this browser for the next time I comment.Post Comment \nΔ",
  "crawledAt": "2026-02-15T20:32:12.183Z"
}