{
  "url": "https://www.rivianroamer.com/guides/account-linking",
  "path": "/guides/account-linking",
  "title": "Rivian Account Linking Guide | Rivian Roamer",
  "text": "What is Account Linking?\n Account linking connects your Rivian account to Rivian Roamer, enriching and building on the Rivian app experience\n by offering real-time insights, richer historical data, and deeper technical insights that help you understand\n your vehicle's performance over time.\n What You'll Get Access To:\n Software update notifications (often before the official Rivian app) and complete update history\n Real-time vehicle telemetry and status\n Detailed charging session history and analytics\n Drive session tracking and efficiency metrics\n Vehicle health and performance insights\n Long-term data trends and statistics\n How Account Linking Works\n Security First: We never store your Rivian password\n Your credentials are transmitted directly to Rivian's servers and exist only in memory during authentication.\n We store only encrypted tokens that Rivian provides, ensuring your password is secure.\n The authentication process is designed to be secure and transparent. Here's exactly what happens when you link your account:\n Enter Credentials: You provide your Rivian login information in our secure form\n Direct to Rivian: Credentials are sent directly to Rivian's servers (never stored by us)\n 2FA Pass-through: Your 2FA codes are passed straight to Rivian\n Receive Token: Rivian validates the 2FA code and returns an access token\n Secure Storage: Only the encrypted token is stored in our database\n Account Security & Management\n Token Lifespan\n Authentication tokens last for 6 months before requiring renewal. You'll receive email alerts before expiration to ensure uninterrupted service.\n Revoking Access\n You can invalidate tokens and disconnect Rivian Roamer at any time by:\n Unlinking your account in Rivian Roamer settings\n Changing your Rivian password (invalidates ALL tokens everywhere)\n Revoking access through your Rivian account settings\n Enhanced Security Option: Secondary Driver Account\n For maximum security, you can create a secondary driver account specifically for Rivian Roamer.\n This isolates access from your primary account while maintaining full functionality.\n How to Set Up a Secondary Account:\n You can use \"plus aliasing\" with your existing email (e.g., yourname+rr@email.com) to create\n a new Rivian account without setting up a new email address. This secondary account will be used exclusively\n for Rivian Roamer.\n Create the secondary account: Sign up for a new Rivian account using your plus-aliased email\n Open the Rivian App on your phone (logged in with your primary account)\n Scroll down and select Drivers and Keys\n Tap on the Share Vehicle Access button\n Tap on Invite a Driver and Next\n Enter your secondary account email and tap Invite Driver\n Important: Accept the invitation sent to your secondary email address\n Link the secondary account to Rivian Roamer instead of your primary account\n Note: Repeat steps 2-7 for each vehicle you want to monitor in Rivian Roamer.\n If you purchase a new vehicle in the future, remember to invite your secondary account as a driver for that vehicle too.\n Location Privacy and Secondary Accounts\n Applies to: Rivian Roamer Plus (drive and charging maps)\n If the linked Rivian account has the Hide Location setting enabled in the Rivian app,\n Rivian Roamer cannot receive vehicle location data. Drive and charging sessions will record, but\n maps and location-based insights will be unavailable until location sharing is re-enabled.\n When this matters\n This most commonly affects users who link a secondary driver account for Rivian Roamer.\n If that secondary account has Hide Location turned on, Roamer will not receive location for that vehicle.\n What you’ll see in Roamer\n No map for drive sessions\n No map for charging sessions and reduced location context\n Limited location-derived insights (e.g., at-home detection, route context)\n How to confirm or fix\n Open your Rivian app\n Scroll down to and tap on Location\n Confirm Hide Location is toggled OFF\n Changes may take a few minutes to reflect. After turning off Hide Location, start a short drive or\n plug in to a charger to generate fresh data with location.\n Have more questions?\n Find answers about account linking, security, and more in our help center.\n Visit Help Center\n This action cannot be undone.\n Cancel\n Confirm",
  "crawledAt": "2026-02-19T03:41:29.313Z"
}