{
  "url": "https://www.riviantrackr.com/",
  "path": "/",
  "title": "RivianTrackr | Rivian News, Reviews and Updates",
  "text": "Skip to content\n RivianTrackr\n Rivian R2How Rivian R2 Suspension Differs From R1Jose Castillo02/18/2026No CommentsRivian’s R2 introduces a simpler semi-active coil suspension system compared to the air suspension setup found in R1, focusing on comfort and control without adjustable ride height. Here’s a straightforward breakdown of what that means and why it matters for everyday drivers.\nRead MoreHow Rivian R2 Suspension Differs From R1EditorialRivian R2 Faces the Tesla Model 3 BenchmarkJose Castillo02/18/20263 CommentsTesla delivered fewer than 2,000 Model 3s in its first six months on the market back in 2017, a reminder of just how brutal scaling a mass market EV can be, so if Rivian manages to deliver 25,000 R2s between June and December 2026 it would represent a dramatically faster ramp, not because it is easy, but because Rivian is entering its scale phase with years of production experience and an industry that has matured since Tesla fought through production hell.\nRead MoreRivian R2 Faces the Tesla Model 3 BenchmarkRivian R2Doug DeMuro Says Rivian R2 Pricing Is “Quite Compelling” Ahead of March 12 RevealJose Castillo02/16/20263 CommentsDoug DeMuro gave the Rivian R2 a strong 70 Doug Score and says its launch edition pricing is “quite compelling,” adding even more momentum ahead of Rivian’s full March 12 reveal.\nRead MoreDoug DeMuro Says Rivian R2 Pricing Is “Quite Compelling” Ahead of March 12 RevealRivian R2Rivian Removes 2027 Timeline From Europe R2 PageJose Castillo02/15/20263 CommentsRivian has quietly removed the 2027 timeline from its European R2 website, replacing it with a simple sign up page and no official launch year. While nothing has been formally announced, the move follows Canada’s shift to a 2027 release and suggests Rivian is concentrating heavily on a US first rollout, leaving Europe’s R2 timing increasingly uncertain.\nRead MoreRivian Removes 2027 Timeline From Europe R2 PageRivian Commercial VanRivian Developing New Electric Van Variant With Bigger Battery and AWDJose Castillo02/13/20268 CommentsRivian is developing a new Electric Delivery Van variant featuring a larger battery with roughly 30% more range and an all-wheel drive setup, expanding route flexibility, improving traction in tougher conditions, and strengthening the platform that already powers more than 30,000 vans across the U.S.\nRead MoreRivian Developing New Electric Van Variant With Bigger Battery and AWD\n Subscribe on YouTube\n Rivian reviews, tips, and electric truck adventures\n Accessory Guide\n Curated Rivian gear with affiliate discounts\n Tire Guide\n User ratings, tire comparisons, and purchase links for Rivian owners\nTrending SearchesPopular searches in the last 24 hours2026.03IonApple CarPlayWatchR1 and LIdar\n Vehicle 2026.03\n Early Access: 02/06/2026\n Public Release: TBD\n Mobile 3.8.1\n Public Release: 12/24/2025",
  "crawledAt": "2026-02-19T03:36:55.445Z"
}