{
  "url": "https://riviantrackr.com/news/real-world-data-shows-rivian-r1s-dual-standard-lfp-range-gap-vs-epa",
  "path": "/news/real-world-data-shows-rivian-r1s-dual-standard-lfp-range-gap-vs-epa",
  "title": "Real World Data Shows Rivian R1S Dual Standard LFP Range Gap vs EPA",
  "text": "Skip to content\nThe Rivian LFP calibration saga continues, and now we have real world data from a Gen 2 R1S Dual Standard that shows exactly why some owners are uneasy.\nA friend reached out with detailed numbers from his Gen 2 R1S Dual Standard equipped with the LFP battery and riding on the 20″ All-Season wheels. For reference, Rivian quotes this configuration at 258 miles of EPA estimated range.\nHe started the day at 98% state of charge. After driving 60.3 miles, he ended at 38%. That means he used 60% of the battery to travel just over 60 miles. His efficiency for that drive was 1.35 mi/kWh. The vehicle currently reports usable battery capacity at 94.2 kWh. If you multiply 94.2 kWh by 1.35 mi/kWh, that implies a total practical range of roughly 127 miles.\nBattery capacity over time (Thanks to Rivian Roamer)\nThis is a configuration rated at 258 miles EPA. Based on that day’s efficiency, the math suggests barely half of that. At 85% state of charge, the vehicle was showing just 115 miles of estimated range. If you scale that to 100%, that implies roughly 135 miles total. Again, far below what owners expect from this setup. Driving was done about 70% highway and 30% local roads at local speed limits.\nNow we do need to talk about weather. He charged at a Tesla Supercharger to 85% the day before. After charging, the battery temperature was around 90º F. The next morning, once the battery cooled down to 44º F in extremely cold weather, the state of charge dropped from 85% to 73% without the vehicle being driven.\nThe temperature hit 13º F, the coldest it has been in his area in nearly 15 years and cold absolutely crushes efficiency, especially with LFP chemistry. Lower temps increase internal resistance, reduce available power, and can temporarily limit usable capacity. So yes, winter is part of this story.\nEven accounting for cold weather, the combination of 1.35 mi/kWh efficiency, dramatic state of charge swings, and range estimates that imply barely half of EPA is exactly why the ongoing calibration issue still matters. And putting weather aside, many other Gen 2 Dual Standard owners living in warmer conditions have been experiencing similar issues.\nRivian has already acknowledged that some Gen 2 Dual Standard vehicles with LFP packs have not fully completed battery calibration. Owners have been instructed to repeatedly charge to 100% to allow the system to relearn and improve accuracy.\nThe question now is whether this is purely calibration lag, extreme cold compounding the problem, or a battery management system that is being overly conservative while it sorts itself out. Most importantly, this does not look like permanent battery degradation. It looks like the BMS still trying to dial in usable capacity under real world conditions. But when your 258 mile rated R1S is effectively behaving like a 130 mile vehicle in winter conditions, that gap feels massive from the driver’s seat.\nIf you’re running a Gen 2 R1S or R1 Dual Standard with the LFP pack, especially in cold climates, I’d love to see your numbers. The more real data we gather, the clearer this situation becomes.\n 10 Comments \n I’d be more concerned about going from 85% to 73% overnight. If they’re paying Supercharger rates for that power only to see it “evaporate”, some folks are going to be pi**ed. I’d like to see the energy monitor on that vehicle.\n Some people say 300 mi range is unnecessary and all we need are cheap EVs with 100 mile range. But this is exactly why that take is wrong, especially for people in cold climates. \nThat said 1.35mi/kwh is not that bad for this cold. Driving in VT this past weekend at <5F, my Gen 1 Quad was at 0.95 mi/kwh\n If he is loosing that much to vampire drain then something is wrong with his vehicle.\nWithout knowing more specifics about the driving (it’s easy to say “about 70/30 highway/local at speed limits as a very very unlikely generalization). This report is highly suspect\n This report is “suspect”? Friend, plenty of others have been reporting similar issues with their Rivian LFP battery. Kyle from Out of Spec has seem this exact same issue, I have friends here in Florida in warmer weather having this issue.\n I’m in NJ and yes its been hella cold for almost a month, not peaking above freezing until just this week but the battery range on my LFP dual range standard on “range” wheels has been abysmal. I charge to 100% every night or 2, mainly because range is an issue now, and my r1s (gen2) is showing 235m to start the day and my efficiency is usually around 1.2-1.4 max in this cold. my wife’s model Y and my old model 3 both had cold weather issues but it was never as dramatic. I drove to my mother’s house about 80 miles away and it took 60% battery. I’m not new to EVs and dont drive them “hard”. in the summer I average around 2.9-3\n Let me know how I can send you the info you need, I have a dual standard, early build. I’ve never been unimpressed with the range really, have on rare occasions gotten more than it stated I should, but that gradually has gone down more and more. I do have aftermarket off road tires on now and I believe I’m averaging about 1.5mi/kwh or so. Rivian roamer says my estimated pack capacity is 91.8KWH currently. That bounces around between that and about 95kwh.\n Happy to review more data, you can email [email protected] 🙂\n 1.35 mi/kwh is very low for a dual motor variant, even in cold temps. It sounds to me like Rivian might be measuring efficiency based on battery percentage and not actual energy use. That would mean if the battery is only giving half the energy in the pack (for whatever reason, BMS sway, weak cells, etc), then it would be stating about half the efficiency as well. Wild.\n I would be curious how much the 20’s vs 22’s are factoring in as well. I have an dual standard gen 2 with the 22 inch sport wheels and haven’t felt much of an impact on range when it was below freezing (granted we have not had the extended periods in texas). If it would help I would be happy to provide data or ideally build it into the data you already collect that way you could collect from every vehicle in the database.\n Happy to provide you with more data. I’ve experienced this first hand in NJ when we had the cold spell. My Dual Standard’s LFP BMS dropped the apparent capacity from 92.5 kWh to 57 kWh at times. And with a 1.2 – 1.5 mi /kW efficiency, the car range *with a full battery* was effectively something like 70 mi – 90 mi. That’s unacceptable for a 90k SUV that’s supposed to be rugged and deliver 270 miles of range\n Leave a ReplyCancel ReplyYour email address will not be published. Required fields are marked *\n Name  *\n Email  *\n Add Comment *\n Save my name and email in this browser for the next time I comment.Post Comment \nΔ",
  "crawledAt": "2026-02-19T03:37:07.216Z"
}