{
  "url": "https://riviantrackr.com/news/rivian-r2-canada-launch-delayed",
  "path": "/news/rivian-r2-canada-launch-delayed",
  "title": "Rivian R2 Canada Launch Delayed",
  "text": "Skip to content\nRivian has quietly updated the Canadian R2 page, and the timeline has officially slipped. Where it previously said the R2 would launch in Canada in 2026, it now shows 2027. On top of that, the original starting price of $66,500 CAD has been removed entirely.\nThat tells us two things. First, Canada is clearly not part of the initial R2 rollout plan anymore. Second, pricing is likely still in flux, or Rivian simply does not want to lock anything in until the U.S. strategy is finalized.\nRight now, Rivian’s full attention is on launching R2 in the United States. The configurator, full specs, and official pricing are all set to be revealed on March 12. Once the U.S. version is locked in and production ramps, international expansion, including Canada, will follow.\nFrom a business standpoint, this makes sense. Rivian is still scaling production, optimizing costs, and navigating a shifting EV market. Focusing on a strong U.S. launch first reduces complexity and risk. Expanding into Canada likely depends on manufacturing capacity, supply chain stability, and of course how aggressive Rivian wants to be with pricing.\nStill, for Canadian reservation holders who were planning around a 2026 arrival, this is a clear delay. A full year push, plus pricing uncertainty, changes expectations.\nThe good news is we are only weeks away from getting concrete details for the U.S. version. Once we see how Rivian positions R2 on March 12, we will have a much better idea of what that 2027 Canadian launch might look like, and where pricing could realistically land.\n 12 Comments \n I can’t imagine this is due to EMC/EMI standards that are woefully over restrictive causing all sorts of architectural issues for EV launches in That region ….\n It’s likely tariffs.\n I heard 50k and premium on the call, so if they can lock in on that it’s amazing.\n Realistically this has nothing to do with manufacturing capacity and everything to do with countervailing tariffs Canada imposed in response to Trump’s tariffs on Canada.\nThis is an American star auto company paying a big price for Trump’s policies.\n This is a really outdated perspective. Canada removed any counter tariffs on autos months ago. Especially as US autos made within the states would comply with USMCA. It does seem like Rivian is just going to have issues scaling up production to meet demand and decided to prioritize US customers over their Canadian counterparts.\n From what I’ve read Rvians are still subject to Canadian tariffs as per Chatgbt. Their Canadian pricing seems to reflect this. Rivian Vancouver told me that tariffs have killed their Canadian sales. I was thinking of upgrading my R1T but not a chance at Rivian’s current CAD$ prices.\nChatgbt:\n“Rivian vehicles sold in Canada so far generally have not been accepted as meeting CUSMA’s auto rules of origin for exemption, so they’ve been subject to Canadian tariffs.”\n Afraid not. I had my R1T serviced recently and asked the service advisor how sales were. He said the 30% tariff was making Rivian unaffordable.\n This is such a disappointment. I am an early Canadian reservation holder and have been planning my whole year around a 2026 launch. Now Canadians have to wait 3 years since announcement to get their preorders? I can’t express how very disappointing this is for me.\n For me it was well worth it to wait 3+ years for my R1T LE. After (almost) 4 years of ownership and 96k+ miles driven I can say that it was worth the wait…\n Thankfully they will be able to get some good EV’s this year from China. It sounds like the normal plant won’t really be producing at capacity as fast as we had hoped.\n Buy anything but American made EVs.\nWould you buy a car from the Nazi’s in 1939\n My R1T after a 3 year wait was definitely not what I had ordered and Rivian tells more lies than Pinocchio. So best wait to see what they do than take anything they say as the truth. Most likely what they have said will never come to fruition from my experience. I can guarantee it will have four wheels and it will leave you stranded with an obnoxious beeping noise for 5 hours in a snow storm with no heat. Or at least that was my experience when Battery Isolation box failed because of a bad 12v battery.\n Leave a ReplyCancel ReplyYour email address will not be published. Required fields are marked *\n Name  *\n Email  *\n Add Comment *\n Save my name and email in this browser for the next time I comment.Post Comment \nΔ",
  "crawledAt": "2026-02-19T03:37:19.721Z"
}