{
  "url": "https://riviantrackr.com/news/rivian-explains-r2-electronic-door-latches-after-concerns",
  "path": "/news/rivian-explains-r2-electronic-door-latches-after-concerns",
  "title": "Rivian Explains R2 Electronic Door Latches After Concerns",
  "text": "Skip to content\nRivian’s software chief, Wassym Bensaid, jumped into Reddit this morning to address concerns about one of the bigger changes coming to R2 and already present on Gen 2 R1, electronic door latches.\nHe started with a reminder that safety drives every product decision at Rivian. The company is currently the only American automaker to earn Top Safety Pick+ in the Large SUV category for vehicles built after August 2024 from the Insurance Institute for Highway Safety. That context matters as fans question the move away from traditional mechanical latches.\nThe biggest worry is simple. What happens if power is lost in a crash?\nAccording to Wassym, Rivian designed the system with full redundancy between the high voltage battery and the 12V system. In a collision, the architecture is built to maintain power to the electronic door system. This is not a single point of failure setup.\nBut the real advantage is what software enables. He highlighted child locks as an example. In a traditional mechanical system, engaging child lock physically disconnects the inside handle, meaning rear passengers cannot exit without someone opening the door from the outside. With Rivian’s e-latch system, the vehicle can detect a crash, automatically release child locks, and unlock the doors, allowing rear passengers to exit on their own when safe.\nThis is very much in line with Rivian’s broader direction. R2 and Gen 2 R1 are being built as deeply integrated, software driven platforms. The e-latch is not just a design change, it is part of a larger shift toward smarter, more coordinated safety systems.\nSkepticism is fair, but Rivian is making it clear this move is about capability and safety, not cost cutting.\n 27 Comments \n That’s great, but not everything needs to be “software driven”. I prefer the mechanical handles on the inside of my Gen 1 R1T. Am interested to see what changes come out of China (with their recent moves to make things like recessed door handles illegal).\nWill probably think twice about any vehicle that doesn’t have a mechanical backup in the future, or at least until these are clearly demonstrated to the public. I’m talking about: let’s take an R2 and see the front end get ripped off by a passing semi, or push it off a bridge or something, and then test if the door locks still work. I’m talking about real, real-world testing – and post it publicly – if they want to inspire confidence in consumers.\n The R2 actually has a manual latch release on all 4 doors without removing any trim, etc. Jerryrigeverything showed them in his review\n When 12v power is gone, the doors cannot be opened from the outside, as shown by Out of Spec. The manual latch releases in the rear are hidden, which makes them effectively useless.\n While it’s great that they are trying to reassure people that the electronic door latches are safe, the reality is that they are not. Redundancy is great but how are the wires routed to the door? Unless they come through two separate and entirely independent channels they are not actually redundant and there is (at least one) single point of failure. One accident that severs the power feed and it doesn’t matter that it powered by multiple sources.\n This is 100% spot-on. \nAlso, in a few of the incidents with other vehicles the inability of people responding to a crash being unable to open the doors from the outside was noted. How does Rivian fare in this scenario?\nHiding the rear emergency latches under a panel you need to pop out is BONKERS. I get it that since “child safety locks” exists regulators obviously don’t care that you can purposely setup a scenario where the rear doors cannot be opened from the inside, but it’s still insane, IMO.\n I think the trained engineers at Rivian and independent safety analysts might be more qualified to decide what is or isn’t safe than us. I think that while it is good to have a questioning attitude, it’s dangerous to simply assume that domain experts are incompetent because what we have read online or have unanswered questions about a topic. I takes a bit humility and intelligence to realize that despite what high-level summaries explanations that we have read, there is a lot of important technical background that we are missing to make technical assesments about a domain for which we don’t have formal training and work experience.\n The issue is that the latches are ‘fail secure.’ I think more people, including myself, would be much more comfortable if they were ‘fail safe.’ Fail Safe means that the hardware is unlocked and usable on both sides in the event of power failure.\n Speaking for myself (and maybe others) I would really benefit from a detailed explanation of the doors from yourself or Wassym. I am still confused after reading that Reddit thread. He says the mechanical latches in the back are for service cases in which there is “no high voltage and low voltage power”. So implicitly there are cases in which the mechanical latches are needed? So I am not sure why they are so hard to get to? Kyle from OOS just demonstrated with his LFP Gen 2 that none of the doors open when there is no power so I don’t feel great about there never being an instance in which mechanical latches are needed, inside and out. Through accidents, bugs, or other situations it is kind of terrifying that you or a loved one could be trapped in your vehicle.\n My wife’s Volvo and a lot of other cars automatically unlock in a crash. If Rivian really is concerned they could just add another acuator to release mechanical child locks also with software. This is a serious miss for R2 that I have a reservation on to replace the Volvo. This is about cost cutting NOT safety. I am staying with my Gen1 R1S with its mechanical handles and starting to look elsewhere for Volvo replacment.\n I was involved in a crash almost 2 years ago in an r1 and all of the doors and everything unlocked automatically when the crash happened. The one thing that was weird was that the center console was not accessible until you got power back to the vehicle, but otherwise getting out of the vehicle was not an issue. I’m still not a fan of the electronic door locks. I don’t think they solve a real problem to be honest and I still think that unless they put the manual disconnect in a co-located space with the regular electronic opening it’s still a hassle for anyone trying to figure out how to get the door open in an emergency. You should be able to follow the same motion to open the door mechanically in an emergency that you would otherwise and anything less than that I feel is a design flaw. The motion should be identical at all times.\n “With Rivian’s e-latch system, the vehicle can detect a crash, automatically release child locks, and unlock the doors, allowing rear passengers to exit on their own when safe”.\n It appears they have removed the lock/unlock buttons on the door for the production models.\n Yes, it does match R1 now with having the unlock/lock in the center screen or while in Park, clicking the button will unlock door.\n I will very likely cancel my R2 reservation due to the arrogance of their engineers. A door handle has one purpose. It does not need to be software-defined.\n The electronic door latches on the R2 was also a concern of mine. Some of my past vehicles with mechanical child safety locks required you to pull on the handle twice to override the safety locks – which is safer than not using the child safety locks but still not ideal. I still prefer my Gen 1 R1T’s mechanical handles over the buttons. I also don’t have little kids to worry about.\n Electronic door latches are a solution in search of a problem. They can claim redundancy all they want, but as was mentioned earlier, unless there is a redundant set of wires, power redundancy doesn’t have much value. And it’s not like I would expect to get new features in an e-latch through a software update. I get that Wassym is Rivian’s software guru, but not everything is better when handled through software.\n Do mechanical door latches need two independent sets of cables routed along two paths to satisfy you?\nThe “redundant” is “HVDC battery or LVDC battery power is enough for the eletric latches to still work” not “no random fragment of metal can disable it”. They also have a manual latch pull which in the front seems fine, the ones in the back have a small trim piece you pop off and pull a cable which does not seem like a good solution.\n This is all about saving 10 bucks per car by not having 100% safe mechanical door openers. Never get in a car without them.\n There are some safety features that you can implement if the doors are electronically latched. For example if an imminent crash is detected, the seat belt already pulls you into the seat. Similarly the doors can be proactively opened.\nIndustry started with accel by wire, then steering by wire, now braking by wire (example R2).\nIf people do not like door buttons, Rivian will come up with a mechanical handle connected to the electronic door latch via wires ;-).\n Sorry, I meant “unlock”, not “open”\n So let me get this straight: R2 gets not 1 but 2 glove boxes but mechanical door handles is crazy talk. I’m fortunate (?) to have them with my Gen 2 R1S Tri but apparently that’s a 6 figure feature (and of course no glove compartment) . R2 is the future and I really hope it sells like crazy but shortsighted decisions like this, lack of Car Play, etc., are going to result in resounding “nos” rather than easy wins. I’m sure these features will come eventually but by that time, it might be too late. I truly hope I’m proven wrong.\n This is why the scout is going to have a market. Sometimes buttons are just better. Why not have an electronic actuator for the seatbelt so it doesn’t let us out until it detects that we are safe to be released. All of these things just create more potential sources of failure. I can make my peace with getting rid of the buttons for the air conditioner, but the door is a safety issue. Progress for the sake of progress is just hubris.\n My Gen2 R1S Duel doesn’t have technical door latches, unless you mean the “emergency use only mechanical latches” which the R2 definitely has for the front seats (and if “cable pull hidden behind a trim piece” counts) arguably the rear as well.\n With regard to all the “negative comments” the train has left the station: welcome to a new brave world! AI robots are driving entire processes but we still want antiquated systems in our most intimate ubiquitous conveyances? Come on quietly or screaming. We match on. Congratulations Rivian. R1S gen2 owner\n Which doors in your home have electronic latches? And if they were fail secure rather than fail safe, would you be comfortable with that?\n When out Ford Windstar minivan got t-boned by a full sized Chevy pickup truck driven by a drunk, high, unlicensed driver we rolled 7 times. The doors were all bashed in but I was able to pull the handle and get my toddlers out of their car seats before the van caught on fire. I hate the idea of relying on electronics and wiring to survive such a massive crash. Yes, they look cool but they are definitely a step in the wrong direction.\n Is a system relying on wiring to survive more or less delicate then a system that relies on a sturdier cable to survive AND a tunnel not to get crushed around the cable or anything else in the accident to prevent the cable from being able to slide? It is possible that the electronic system is more likely to survive (although far from proven — I’m just saying it is possible, not that it has been designed to be more durable)\n Leave a ReplyCancel ReplyYour email address will not be published. Required fields are marked *\n Name  *\n Email  *\n Add Comment *\n Save my name and email in this browser for the next time I comment.Post Comment \nΔ",
  "crawledAt": "2026-02-19T03:37:29.732Z"
}