{
  "url": "https://riviantrackr.com/news/dont-expect-leasing-when-rivian-r2-launches",
  "path": "/news/dont-expect-leasing-when-rivian-r2-launches",
  "title": "Don’t Expect Leasing When Rivian R2 Launches",
  "text": "Skip to content\nAs Rivian gets closer to launching R2, one expectation worth resetting early is leasing. There’s a strong chance Rivian will not offer leasing at launch, and history backs that up.\nWhen Rivian launched R1T and R1S, leasing was not available. Early buyers could purchase or finance, but leasing arrived much later once production stabilized and Rivian had real-world data on depreciation and demand. Even today, leasing for R1 is still not available in every U.S. state, and it is not offered in Canada at all. That alone should temper expectations for R2.\nRivian R2 represents a much bigger shift for the company. Lower price, higher volume, and a broader audience means tighter margins and more financial risk. Leasing requires confidence in residual values, and with a brand-new platform, battery strategy, and customer base, that confidence simply does not exist yet. Offering leases too early either forces conservative terms that look unattractive to buyers or exposes Rivian to losses if resale values miss the mark.\nProduction realities matter too. Early R2 builds will likely be constrained, just like R1 was. When supply is limited, prioritizing outright sales makes sense. Selling vehicles immediately improves cash flow and avoids tying inventory up in lease portfolios, something Rivian is unlikely to rush into during a critical launch phase.\nThere’s also the buyer mix to consider. Early R2 customers are likely to skew toward enthusiasts and early adopters (like me), many of whom are more comfortable purchasing outright. Leasing typically becomes more important once a vehicle moves deeper into mainstream adoption, which usually happens after the initial launch window.\nNone of this means leasing will not come. It probably will, just not right away, and likely not everywhere at once. Based on Rivian’s track record with R1, leasing for R2 may arrive months later and roll out gradually by state, with Canada potentially waiting even longer.\nIf leasing is a must-have, patience will likely be required. If you want to be among the first R2 owners, purchasing may be the only path at launch. Rivian has shown it prefers disciplined rollouts over aggressive incentives, and R2 looks poised to follow that same playbook.\n 5 Comments \n Rivian needs to get this leasing thing figured out. It’s pretty ridiculous that they still can’t offer it in all markets. They’ve had more than enough time to get it sorted out. Even Lucid has figured it out. Given how popular leasing is for EVs, that’s just leaving money on the table.\n That’s actually not true. Lucid is not available in all 50 states either, only 43. The issues typically come from laws around direct to consumer businesses, a lot of states favor dealerships who lobby to prevent direct to consumer manufacturers from sharing in the market. Some states like Texas double tax on leases making them not great options for consumers. These a law issues that if you read the news, have been battled companies like Rivian have been fighting to change, you may want to reach out to your representatives and tell them that you support leasing for direct to consumer manufacturers.\n You are correct, Lucid leases in only 43 states. My bad. However, I live in a state that allows direct to consumer sales, so that isn’t the reason. Lucid does offer leases here, yet Rivian does not. Ridiculous. Again, Rivian has had more than enough time to get this figured out and if they don’t offer leases here on the R2, they will be losing potential customers. I’d argue that leasing will be more important for the R2 than it was for the R1. The R1 is expensive, regardless of whether it is financed or leased. With the cheaper R2, leasing would offer a monthly payment that more people can afford.\n Everything written makes sense but it’s basically all risk mitigation against the unknown. Conversely that means Rivian is asking enthusiasts and early adopters to take a risk on everything you’ve outlined. Sometimes it is better as a company to absorb the downside risk. \nI suspect it is not actually Rivian that is taking on the risk fully but the leading company (eg Chase). They may be unwilling to take on unbounded risk, & it may be impossible for Rivian to secure that risk themselves.\n Well they’ll lose my day one sale if leasing isn’t an option. I put in my reservation right when RJ hit the stage and leased my R1S right after it was announced R1 owners would get priority. I also have a reservation on an Also TM-B. I just don’t buy cars. I don’t have any interest in owning something longer than a few years. My plan was launch R2 on a two year lease and trade in again for a R3X. I have time on my R1 lease, but if leases aren’t available by the time it’s up, I might need to look elsewhere. I have a reservation on a Scout too that I was planning to cancel. Guess I’ll hold onto it a bit longer to be safe.\n Leave a ReplyCancel ReplyYour email address will not be published. Required fields are marked *\n Name  *\n Email  *\n Add Comment *\n Save my name and email in this browser for the next time I comment.Post Comment \nΔ",
  "crawledAt": "2026-02-19T03:38:09.565Z"
}