{
  "url": "https://riviantrackr.com/news/rivian-update-2026-03-brings-apple-watch-app",
  "path": "/news/rivian-update-2026-03-brings-apple-watch-app",
  "title": "Rivian Update 2026.03 Brings Apple Watch App",
  "text": "Skip to content\nRivian is officially bringing an Apple Watch app to both Gen 1 and Gen 2 R1 vehicles with software version 2026.03, and honestly, this is just cool. We have had phone as key for a while, but now you can control your Rivian straight from your wrist. That feels very on brand.\nWith the upcoming Rivian mobile app update 3.9, the Apple Watch companion app lets you lock or unlock your doors, vent the windows, sound the alarm, tweak the cabin temperature, and even set your target state of charge using the digital crown. You can also customize it with up to four quick controls, so the stuff you actually use is right there, one tap away.\nGen 2 R1 owners get an extra flex. If digital key is set up, passive entry works with the watch, meaning you can literally walk up to your Rivian and it unlocks as you approach. No digging for your phone. Just walk up, hop in, and go. On Gen 1 R1, you can still lock and unlock with a tap, just make sure the app is foregrounded (actively open) if you want to use it as a key.\nIs this life changing? Maybe not. But running out for a quick drive without your phone, preconditioning the cabin while walking across a parking lot, or adjusting your charge limit while standing next to a charger feels way more seamless when it is all on your wrist. It is a small feature that makes the whole experience feel more polished.\nRivian keeps leaning into the software side of things, and this is another reminder that your truck or SUV is part of a bigger ecosystem. And now that ecosystem fits on your watch.\n 9 Comments \n Any indication whether there will be a parallel WearOS app?\n I think android makes things a tad more difficult with fragmentation but maybe they will in the future.\n For those with a Pixel Watch I suspect it is doable. Pixel is Google’s brand and the purest form of Android without carrier or manufacturer apps that don’t follow the rules.\n Hope so! I had the choice of so many Tesla apps on my Galaxy watch, before I got my R1T. It’s hard to believe that a Rivian WearOS app would be all that tough.\n No mention of popping the hood or the lift gate. I sure hope it can because this is my primary need in a watch app.\n I follow you on everything you say and\nYou make a lot of sense with the Rivian stuff\nJust wanted to say thanks for your support!!\n Any idea how this will work if the phone is nearby? I’d love to lock my phone in the truck when going for a run and rely on the watch – but don’t want the truck to sense the phone and unlock. Excited to try it out.\n I know my wife has to turn Bluetooth off when leaving her phone in our Tesla for a run. Hopefully it’s that easy as you said and just lock with your watch. I’m looking forward to that because I have Proximity Unlock set to OFF At Home as it was blocking so often. To have an option on my wrist would be nice\n A lot of us are outdoorsy ppl with Garmin watches and devices. It will be good if Rivian collaborate with Garmin, especially on the higher end Fenix and Enduro series.\n Leave a ReplyCancel ReplyYour email address will not be published. Required fields are marked *\n Name  *\n Email  *\n Add Comment *\n Save my name and email in this browser for the next time I comment.Post Comment \nΔ",
  "crawledAt": "2026-02-19T03:37:45.449Z"
}