{
  "url": "https://riviantrackr.com/news/rivian-pledges-millions-to-change-washingtons-ev-sales-laws-amid-clear-conflict-of-interest",
  "path": "/news/rivian-pledges-millions-to-change-washingtons-ev-sales-laws-amid-clear-conflict-of-interest",
  "title": "Rivian Pledges Millions to Change Washington’s EV Sales Laws Amid Clear Conflict of Interest",
  "text": "Skip to content\nRivian is escalating its push to change how electric vehicles are sold in Washington state, and the stakes for the company are high.\nFilings with the Washington Public Disclosure Commission show Rivian had contributed more than $130,000 to the Washington Coalition for Consumer Choice and Innovation by the end of 2025. Those filings also show Rivian has pledged a total of $4,620,000 to support a ballot effort aimed at allowing direct EV sales.\nRight now, Tesla is the only automaker legally allowed to sell vehicles directly to consumers in Washington. Rivian and Lucid can operate showrooms, including their University Village locations in Seattle, but they cannot complete sales, conduct test drives, or transact directly with buyers.\nWashington is also one of Rivian’s strongest markets in the country, with a high concentration of EV adoption and Rivian ownership. That makes the state’s franchise laws especially frustrating for a company that already has significant demand but is blocked from fully serving customers locally.\nIn 2025, lawmakers tried to address the issue through SB 5592 and companion bill HB 1721. The bills stalled in the House Committee on Consumer Protection and Business, chaired by Rep. Amy Walen of Kirkland, after no action was taken.\nThe conflict of interest is hard to ignore. Public records list Walen and her husband as owners of multiple car dealerships, including Seattle Jeep, Seattle Hyundai, and Hyundai of Kirkland. Those dealerships directly benefit from the franchise laws that prevent Rivian and other EV makers from selling directly to consumers.\nWalen has said the bill lacked caucus support and needed significant work, but the legislation ultimately died in her committee. The bill has since been reintroduced as of January 12, 2026.\nAfter years of stalled legislative attempts, Rivian and other EV makers now appear ready to take their case straight to voters. To qualify for the November ballot, the initiative would need more than 300,000 signatures by July.\nFor Rivian, this is not a theoretical fight. Washington is a key market, and direct sales access could significantly reshape how the company sells vehicles in one of its most EV friendly states.\nThanks to Chad for calling attention to this article.\n 4 Comments \n Thank you for highlighting this Jose! As a fellow Washingtonian, it has been incredibly frustrating to watch this bill get buried each year it has been introduced by simply not bringing it to a vote at all. This conflict of interest with Amy Walen has been around for years and it does not get the attention it deserves. I would love to see more channels like Out of Spec, Gjeebs, and others, highlight this to help promote awareness! The big question is, where do I sign?\n Oregonian here. We’re friends, fellow PNW’s. This is nuts and it shouldn’t stand. It’s corruption. Have you contacted you own rep in the state legislature?\n Yes, my rep was a sponsor of the bill. Anyone in Washington who wants to test drive a Rivian currently has to drive down to Oregon to do so. It sure doesn’t stop Washingtonians from buying a Rivian though, they are everywhere! People like Amy Walen are just an annoyance in delaying the inevitable. I’m glad Rivian is stepping up to make sure this doesn’t get buried this time.\n Change.Org could get some traction as well as the state AG.\n Leave a ReplyCancel ReplyYour email address will not be published. Required fields are marked *\n Name  *\n Email  *\n Add Comment *\n Save my name and email in this browser for the next time I comment.Post Comment \nΔ",
  "crawledAt": "2026-02-19T03:38:30.061Z"
}