{
  "url": "https://www.riviantrackr.com/",
  "path": "/",
  "title": "RivianTrackr | Rivian News, Reviews and Updates",
  "text": "Skip to content\n RivianTrackr\n Rivian Commercial VanRivian Developing New Electric Van Variant With Bigger Battery and AWDJose Castillo02/13/20261 CommentRivian is developing a new Electric Delivery Van variant featuring a larger battery with roughly 30% more range and an all-wheel drive setup, expanding route flexibility, improving traction in tougher conditions, and strengthening the platform that already powers more than 30,000 vans across the U.S.\nRead MoreRivian Developing New Electric Van Variant With Bigger Battery and AWDEditorialRivian R2 at Launch or Wait for LiDAR?Jose Castillo02/13/202621 CommentsWith Rivian R2 just months away from reaching customers, many buyers are debating whether to purchase at launch or wait for the future LiDAR equipped version. Here’s why the launch model will likely deliver everything most drivers actually need, and why waiting could mean chasing upgrades that won’t meaningfully change the ownership experience.\nRead MoreRivian R2 at Launch or Wait for LiDAR?Rivian R2Rivian R2 Canada Launch DelayedJose Castillo02/12/202610 CommentsRivian has updated its Canadian R2 timeline, shifting the launch from 2026 to 2027 and removing the previously listed $66,500 CAD starting price. The change comes as Rivian prepares to reveal full U.S. pricing, specs, and the configurator on March 12.\nRead MoreRivian R2 Canada Launch DelayedCompany NewsRivian Q4 2025: R2 On Track, Software SurgesJose Castillo02/12/2026No CommentsRivian’s Q4 2025 shareholder letter makes one thing clear, R2 is the pivot point. With manufacturing validation builds complete and deliveries still targeted for Q2 2026, Rivian is preparing for its biggest launch yet. At the same time, autonomy hardware, in house silicon, and surging software revenue are starting to reshape the company’s financial story as it pushes toward scale.\nRead MoreRivian Q4 2025: R2 On Track, Software SurgesBattery & ChargingReal World Data Shows Rivian R1S Dual Standard LFP Range Gap vs EPAJose Castillo02/12/202610 CommentsA Gen 2 Rivian R1S Dual Standard owner equipped with the LFP battery and 20\" AllsSeason wheels, rated at 258 miles EPA, shared real world winter data showing dramatically lower range. With efficiency of 1.35 mi/kWh and just 115 miles displayed at 85%, the numbers raise fresh questions about ongoing calibration and cold weather impact.\nRead MoreReal World Data Shows Rivian R1S Dual Standard LFP Range Gap vs EPA\n Subscribe on YouTube\n Rivian reviews, tips, and electric truck adventures\n Accessory Guide\n Curated Rivian gear with affiliate discounts\n Tire Guide\n User ratings, tire comparisons, and purchase links for Rivian owners\nTrending SearchesPopular searches in the last 24 hours2026.03Apple CarPlayApple WatchR2Europe\n Vehicle 2026.03\n Early Access: 02/06/2026\n Public Release: TBD\n Mobile 3.8.1\n Public Release: 12/24/2025",
  "crawledAt": "2026-02-14T22:33:16.578Z"
}