{
  "url": "https://www.rivianroamer.com/software-updates/2025-18",
  "path": "/software-updates/2025-18",
  "title": "Rivian Software Update 2025.18 | Rivian Roamer",
  "text": "Rivian Software Update \n 2025.18\n Powered Up, Locked Down\n Released June 3, 2025\n Get notified before Rivian tells you\n Join 6,150+ Roamers getting early alerts by linking your Rivian account - it's free!\n Join and Connect\n Release Notes\n Gen 1 R1S\n •\n Gen 1 R1T\n •\n Gen 2 R1S\n •\n Gen 2 R1T\n •\n RivianTrackr\n Multi-factor DriveYou can now enable Multi-factor Drive to require a second form of authentication before starting your vehicle. This industry-leading feature increases the security of your vehicle by requiring you to authenticate each time you drive it.When Multi-factor Drive is enabled and you press the brake to shift out of P (Park), a notification appears on the center display. Then you can authenticate from the Rivian mobile app, version 3.1 or later, or via the actionable notification on your smartwatch. If you do not receive the notification, you can also enter a time-based passcode that displays on your smartphone.To enable Multi-factor Drive, log in to the primary owner account in the Rivian mobile app, go to Security and access, and turn on Multi-factor Drive.NOTEOnly a vehicle owner can enable or disable Multi-factor Drive. The setting applies to all drivers and keys associated with the vehicle.When Multi-factor Drive is enabled, a driver won't be able to drive the vehicle using the key fob or key card without authentication.To approve a drive, the driver must have a Rivian account associated with the key and the key must be paired with the vehicle.As a backup option, the driver can also access a time-based passcode on their smartphone. Go to Security and access and choose View time-based passcode.To use Multi-factor Drive, all drivers must have the Rivian mobile app version 3.1 or later installed on their smartphone.New Rivian Energy AppThe new Rivian Energy app introduces features and improvements to increase your understanding and control over your vehicle's energy consumption while driving, parked, or charging. In addition, you can now precondition your battery on demand for fast charging and view your charge curve in the vehicle with improved charge time accuracy. This can help with trip planning and provide greater peace of mind by making your energy usage easier to understand and visualize.Energy Monitor TabProjected range impact: Increase your understanding of your actual energy consumption versus what's expected while driving and while in P (Park). You can gain insight into how your driving behavior affects your range and get useful driving tips. You can also view your parked energy usage on the Rivian mobile app.Usage: Dive deep into your energy usage over selectable timeframes.Session details: View a comprehensive distribution of systems in your vehicle that are consuming energy, including Gear Guard, outlets, and climate.Charging TabGraph: Visualize your active or latest charging session with an interactive graph.Target level for charging stops: When using navigation for a trip that includes a charging stop, now it's easy to see the recommended charge target for your trip from the vehicle or the Rivian mobile app. Simply start your charge, and the app will calculate and notify you (both in the vehicle and on the Rivian mobile app) when you've reached the ideal charge level for your trip.On-demand battery preconditioning: Precondition your battery on demand for fast charging. The system heats or cools the battery to the optimal temperature for fast charging.View the new Energy app on your center display and on the Rivian mobile app, version 3.1 or later.Charging ImprovementsWe've improved DC fast charging performance and consistency for Max pack batteries (Gen 1) and all battery pack variants (Gen 2). These improvements provide better charge times and expanded capability across a larger range of temperatures.Max Pack: Optimized charging algorithms to reduce the time required when charging the battery from 10% to 80%.Standard Pack (Gen 2): Optimized charging algorithms to reduce the time required when charging the battery from 10% to 80%.Large Pack (Gen 2): Optimized charging algorithms to:Improve peak charge rate.Reduce the time required when charging the battery from 10% to 80%.Increase the number of miles added in the first 15 minutes of charging.Additional ImprovementsEnhanced the vehicle visualizations with new, more detailed vehicle models on the driver display.Enhanced the driver display to show a greater number of vehicles across five lanes and in more diverse situations, such as cross-traffic, oncoming traffic, and parked vehicles (Gen 2).Improved the responsiveness of Go Chime, resulting in fewer extraneous chimes (Gen 1).Improved the stability and responsiveness of the infotainment system.Improved the performance and stability of media apps.Optimized low voltage battery management to improve long-term battery health (Gen 2).Fixed a rare issue that caused camera views and recorded videos to be unavailable in the Gear Guard app (Gen 2).\n Build Versions\n Platform-specific builds for each generation\n Gen 1\n 2021-2024\n 2025.18.01\n 0af7578\n Released June 04, 2025\n Notes\n 2025.18.01\n ed8c247\n Released June 03, 2025\n Notes\n Gen 2\n 2025+\n 2025.18.30\n 7c26bdb\n Released June 04, 2025\n Notes\n 2025.18.30\n 61043f2\n Released June 03, 2025\n Notes\n This action cannot be undone.\n Cancel\n Confirm",
  "crawledAt": "2026-02-15T20:34:38.223Z"
}