{
  "url": "https://www.rivianroamer.com/support",
  "path": "/support",
  "title": "Rivian Roamer",
  "text": "Support Rivian Roamer\n Why Support Us?\n Rivian Roamer is a free, ad-free passion project serving the Rivian community. Your support helps cover server costs, maintenance, and new features.\n Supporting is entirely optional.\n Affiliate Link Disclosure\n The links below are affiliate links. We earn a commission on purchases at no cost to you. We only recommend products we believe in, and all opinions are our own. Your support helps keep Rivian Roamer free and ad-free.\n Recommended Products & Services\n A2Z EV\n 5% DISCOUNT\n Visit A2Z Store\n A2Z specializes in high-quality EV charging adapters designed specifically for modern electric vehicles. Their adapters are known for reliability, durability, and excellent compatibility with Rivian vehicles. Use our links for an exclusive 5% discount on all A2Z products!\n NACS to CCS Adapter\n This adapter allows Rivian owners to charge at Tesla Superchargers, expanding your DC fast charging options significantly. Smaller, better built and more ergonomic than the original Tesla adapter.\n Shop at A2Z\n NACS to J1772 AC Adapter\n Connect your Rivian to Tesla destination chargers and home chargers with this AC adapter. Supports up to 48A charging and features a secure locking mechanism.\n Shop at A2Z\n s00nish\n 10% DISCOUNT\n Visit s00nish Store\n s00nish offers premium accessories and gear designed specifically for Rivian owners. Their products combine style, durability, and functionality to enhance your Rivian experience. Use our links for an exclusive 10% discount on all s00nish first party products!\n Gen 1 Charger Replacement\n Replace the original charger with one that works by keeping your phone in its place with Qi 2/MagSafe charging.\n Shop at s00nish\n Gen 2 Charger Replacement\n Replace the original charger with one that works by keeping your phone in its place with Qi 2/MagSafe charging.\n Shop at s00nish\n Abstract Ocean\n 10% DISCOUNT\n Visit Abstract Ocean\n Abstract Ocean specializes in high-quality accessories for electric vehicles, including Rivian models. Their products are designed to enhance both aesthetics and functionality. Use our links for a 10% discount on select products!\n Silicone Tow Hook Covers\n Complete the Tri/Quad or Darkout look with silicone tow hook covers for your R1S/R1T.\n Shop at Abstract Ocean\n Screen Protector Kit\n Reduce glare and fingerprints on all three screens with matte screen protectors.\n Shop at Abstract Ocean\n Amazon\n Shop on Amazon\n Find a wide variety of Rivian-compatible accessories, camping gear, and travel essentials on Amazon. As an Amazon Associate, we earn from qualifying purchases at no extra cost to you.\n Washer Fluid\n Super concentrated washer fluid that works better than anything I've found.\n Shop on Amazon\n Center Console Organizer\n Organize your center console.\n Shop on Amazon\n Partner With Us\n Are you a business interested in reaching the Rivian community? We'd love to discuss partnership opportunities.\n Contact Us\n Thank you for supporting Rivian Roamer!\n This action cannot be undone.\n Cancel\n Confirm",
  "crawledAt": "2026-02-15T20:32:39.734Z"
}