{
  "url": "https://riviantrackr.com/news/rivian-r2-at-launch-or-wait-for-lidar",
  "path": "/news/rivian-r2-at-launch-or-wait-for-lidar",
  "title": "Rivian R2 at Launch or Wait for LiDAR?",
  "text": "Skip to content\nR2 is finally moving from preview mode into real world ownership, and as that reality sets in, the question I keep seeing is whether it makes sense to buy at launch or hold out for the later LiDAR equipped version, as if that single hardware addition is the dividing line between a smart decision and a short sighted one.\nHere’s the honest take, most people do not need to wait.\nRivian’s current autonomy stack, built on cameras and radar, is already powering hands free highway driving, adaptive cruise, lane centering, and a growing suite of assistive features that are actively improving through over the air updates, and none of that is theoretical or dependent on LiDAR to function properly. LiDAR adds redundancy and long term autonomy potential, especially for edge cases and future expansion, but it does not suddenly transform R2 from incomplete to complete, it simply enhances a system that is already capable.\nThe core reason people are excited about R2 has far more to do with its size, price point, design philosophy, and everyday usability than with a specific sensor configuration, and waiting for LiDAR likely means waiting for a later model year, potentially higher pricing, and an uncertain timeline for when software fully takes advantage of that added hardware.\nIf your goal is to future proof for maximum autonomy over the next decade, waiting might make sense, but for most buyers who want a practical, well balanced electric SUV that delivers Rivian’s driving experience and continues to improve over time, the launch version will be more than enough.\nThere will always be a next upgrade, a next sensor, a next breakthrough, and if you keep waiting for perfect, you may never actually buy the vehicle that already fits your life today.\n 28 Comments \n On the earnings call RJ said LiDAR was coming “early 2027”\nI think people were surprised by this announcement but really it’s just a 2027 model year add on, probably 1 year after the initial examples leave the factory\nGiven the huge backlog of orders, I don’t think they will have any problem selling non LiDAR models\n Yeah, I see the 2027 R2 being the LiDAR variant with some other goodies that were cut from the 2026 model year.\n With all of the R2 fleet being able to benefit from the data fly wheel and the large learning module- it’s hard to tell long term what the difference will be once the edge cases from lidar are pushed out through software updates to the whole fleet?\n Exactly, there’s so much unknown about that right now but I feel like Gen 1 R2 will benefit.\n Perhaps RAP1’s added compute power and memory bandwidth could be a running upgrade, even before LiDAR is available. As Tesla learned with the evolution of their FSD software, its capabilities are hardware constrained even without the added data burst that LiDAR provides. The data fly wheel is no different. Its demand for compute power will grow as functionality increases. Tesla FSD 14.x.x pushes even AI4 hardware. Neither of my Tesla’s hardware can support it. That’s why they have AI5 etc in their roadmap for L4 autonomy.\n Is it not primarily just about LiDAR, but also the third-generation hardware that accompanies this change, utilizing two of their custom silicon chips? This is the significant question in contrast because it alters the equation due to the ability to adapt this hardware through software; particularly if any component of this relies on Hardware Description Language (HDL) code, thereby extending its lifespan and adaptability far beyond what a generation 2 can do.\nTesla is known for supporting its models for as long as possible, with a track record to demonstrate this commitment. The pertinent question is whether Rivian will follow suit, given their shorter track record due to the limited time elapsed.\n I have a 2026 Tesla Juniper FSD 14 .2. The cameras do not always work in rain on the highway and sometimes they are blocked from imaginary dust. They would probably work better than my vision in those conditions. I am on the list but waiting for the 3rd gen Hardware with LiDar. My guess is that with Radar and LiDar you have a better chance to have supervised FSD in bad weather. Without the updated chip set you can’t count on an improved FSD lifespan. I do not care as much about autonomous FSD-I think that is years off. I do not think a company will indemnify the driver using it in an accident. I really want Rivian to succeed, they have been decent with their customers compared to Tesla who essentially had a Monopoly (such as: can’t always transfer FSD to another vehicle , high FSD purchase price, removing autosteer to have everyone subscribe to FSD.) Credit is due to Tesla for being the first and creating the supercharger network that everyone will use.\n There will always be a next upgrade, a next sensor, a next breakthrough, and if you keep waiting for perfect, you may never actually buy the vehicle that already fits your life today.\nbut new companies announce it before it’s ready because of risk of tanking sales. \nI’ll be waiting … and then considering Lidar vs. a used R2 depending on prices at the time.\n I’m waiting for the R2 launch and thinking that I might be able to upgrade from an ID4 to an R1t gen 1. Do you think that they will be below $30,000 by the end of 2026?\n I thought it was also about the in-house silicon? Will the older chips be as good for in-car functionality like AI voice assist, etc?\n As far as I understand, the in-house chip is for autonomous driving only. The hardware running the infotainment (including AI assistant) will be the same.\n Is it believed that the first drive R2 were the performance versions?\n I’d bet on it. That’s one perk for the Launch Edition buyers — and it would justify a bit higher starting price to help profit margins. Similar to when Tesla introduced the Juniper Model Y bundled with the $2,000 Acceleration Boost software.\n Am I correct in assuming that the R2 launch software is capable of running similar FSD functionality like is current Teslas? I realize they will need more data.\nI’m under the impression that lidar readies them for Level 4 autonomy where launch hardware would not.\n It will have some Point-to-Point capability, but yet to be seen how it compares to FSD 12.x, 13.x and in particular FSD 14.x.x. From the demo a month ago, it has a very long way to go. Due to hardware limitations, I have FSD 12.x on my old Tesla. It’s like having a 15 year old with a learner’s permit.\n The Gen 1 was marketed with the dream of Level 3 autonomy, but as a Gen 1 R1S owner, I would caution anyone against banking on long term software support for older hardware iterations; the industry moves on faster than the marketing suggests.\n According to Rivian’s Q4 Earnings report (great results, BTW) they shipped just over 42,000 vehicles in 2025 (presumably R1’s + plus some number of Vans). They project 2026 unit sales to be between 62,000 and 67,000 which includes the R2. So assuming R1 sales continue to slip a bit, and Rivian beats their numbers by shipping, say, 75,000 units, that means they expect to only produce about 30,000 to 35,000 R2s this year. So many of us may wind up getting the LiDAR version early next year anyway because they can’t build them fast enough given the order backlog.\n“We expect total deliveries of approximately 9,000 to 11,000 per quarter in the first half of 2026. We plan to start production of the R2 launch variant with a single shift and expect to add a second shift towards the end of the year,” McDonough detailed on the call with analysts.\n This is my dilemma. I don’t want to buy a car I hope to have for 10 years, only to find out that if I wait 6-9 months, I could have ordered one that would be better, future-proofed. Level 4 autonomy is a huge plus in my book, if you can only get that with a Lidar model. Sure, there’s going to be something new and fancy with every model year, but when it comes to self-driving tech, it’s changing so fast. Is the vehicle I buy today going to be ready for it? I think of my Jeep Grand Cherokee, where all the connectivity features no longer work because it only supports 3G cellular networks, and it’s not a serviceable component.\n I’ve had Tesla model Y with Full Self Driving since 2020. What I’ve learned is until I can take my eyes off the road and open my laptop, and use my phone, autonomous driving isn’t valuable and it is more cognitive effort (and anxiety) to be responsible for the way the car drives than to just drive. I love smart cruise control. That’s enough for me. I look forward to the R2 and won’t wait for Lidar.\n This is spot on. I too was wondering whether I should wait for the Lidar version (assuming my spot even gets called this year). But then I thought, in what scenario over the next few years (or more) do we believe autonomous drive will actually advance to the point that I can take my eyes off the road, let the car drive itself, and the car manufacturer is held liable in case of an accident??\n Agreed. I’ve decided that if my place in the order queue gets me a non-LiDAR Launch Edition, I’ll lease it and enjoy driving it for 2 or 3 years, and then upgrade to the latest version when the autonomous driving capabilities will have matured, and since I’ll be in my late 70s, helping me with my mobility independence.\n “Fool me once, shame on you; fool me twice, shame on me.”\nNot making same mistake I did by getting Gen 1.\n As an R1S Launch Edition owner, I’ve definitely paid the early-adopter tax. I am waiting for the Lidar so that the other issues get sorted out . I still have 2 years left on my original warranty and 31 K miles on the SUV.\nI’ve had two suspension failures and the vehicle is currently on a three-week stay at the service center. To Rivian’s credit, they’ve been proactive about replacing known weak points and addressing issues under warranty.\nSo far (31k miles total), the following have been replaced:\nBoth rear dampers\nHydraulic suspension manifold and hydraulic lines\nCracked roof glass (around 14k miles)\nInner tie rod and control arm (24k miles)\nSuspension air compressor (28k miles)\nDoor handle (29k miles)\nCurrently diagnosing an electrical fault related to a drive inverter\nReplacing rear cabin heater\nLeft front half shafts\nBoth front suspension dampers\nThat said, performance has been excellent here in the Northeast where cold weather really tests a vehicle. When it works, it’s fantastic.\nWe don’t really need the hydraulic suspension system, so I’m hopeful the simpler setup in the R2 translates into better long-term reliability.\nStill a believer in the platform and hope that Lidar is worth the upgrade and just hoping the next iteration is more sorted from the start.\n I found this read interesting: https://spectrum.ieee.org/solid-state-lidar-microvision-adas\n I agree with the analysis. The new chips interest me more than the lidar though I’d like both. On the other hand, I want the launch edition if I can get it. (Day 1 Reservation; don’t own a Rivian.) If the Rivian chip/lidar version shows enough benefit, I would sell the launch edition after a year or two and swallow the deprecation as the cost of having an R2 sooner.\n The problem with this article is that it treats buying of cars like buying a phone. Unlike phones, you dont change your car every year to a new version. At least not right now. So we should have every reason to wait to get a complete product instead of an incomplete product rushed off the product line to compete in this market. Certainly if we think the car is made to not last more than 5 years it makes sense to follow the advice in this article.\n Non-vehicle related question. Why refer to the SUV as if it was a person? E.g., “…people are excited about R2 has far more to do with…”\nWhy not say “about THE R2”, it’s an inanimate object, not a person.\n I arrived 9 days late at the reservation desk, so i’m 2027 and Lidar whether i like it or not. (64K on Day 1).\nSo are most of us with reservations, with only about 25,000 tops slated for production this year.\nI’m 75 and time-limited, so i’m reluctantly moving on to paying too much PAC to land an iX3 before i croak.\n Leave a ReplyCancel ReplyYour email address will not be published. Required fields are marked *\n Name  *\n Email  *\n Add Comment *\n Save my name and email in this browser for the next time I comment.Post Comment \nΔ",
  "crawledAt": "2026-02-19T03:37:15.423Z"
}