{
  "url": "https://www.rivianroamer.com/software-updates/2025-10",
  "path": "/software-updates/2025-10",
  "title": "Rivian Software Update 2025.10 | Rivian Roamer",
  "text": "Rivian Software Update \n 2025.10\n Gen 1 RAP & Watchful Gear Guard\n Released April 8, 2025\n Get notified before Rivian tells you\n Join 6,150+ Roamers getting early alerts by linking your Rivian account - it's free!\n Join and Connect\n Release Notes\n Gen 1 R1S\n •\n Gen 1 R1T\n •\n Gen 2 R1S\n •\n Gen 2 R1T\n •\n RivianTrackr\n Driver Assistance• Smart Turn Signal Automation automatically turns off your turn signal after completing a manual lane change on highways. (Gen 1)• New Go Chime Feature alerts you when traffic ahead begins moving while you're stopped. This feature is on by default but can be disabled in Settings. (Gen 1)Vehicle Controls• Smoother Low-Speed Driving significantly reduces vehicle rocking when crossing diagonal speed bumps, parking lot entrances, and asymmetric road features for a more comfortable ride.Adventure• Tonneau Cover Fix resolves issues preventing version 2 of the powered tonneau cover from opening in certain scenarios. (Gen 2)Safety & Security• Enhanced Gear Guard Detection now records video when objects—not just people—are detected near your vehicle.• Critical Tire Pressure Alerts notify you when tire pressure drops to potentially unsafe levels.Infotainment• Expanded SiriusXM Features include dual-stream support for live sports games and direct channel access through Alexa.• Improved Media Management with better scrolling through large Apple Music playlists and enhanced YouTube search and playback controls.Range & Charging• Faster Cold Weather Charging reduces Level 2 charging times in below-freezing temperatures.• Range Display Accuracy fixes calibration issues that caused parked Dual Standard vehicles to show greater than actual range loss. (Gen 2)• Energy Conservation reduces vehicle range loss when 12V battery health is low and minimizes energy use when keys are left near the vehicle. (Gen 2)Comfort & Convenience• Improved Phone Key Response makes locking and unlocking more responsive and fixes pairing issues for Android phones. (Gen 2)• Less Intrusive Notifications reduces the frequency of unbuckled occupant alerts for a better driving experience. (Gen 2)• System Reliability Upgrades improve overall responsiveness, Wi-Fi self-recovery, and fix clock display issues on the rear screen.\n Build Versions\n Platform-specific builds for each generation\n Gen 1\n 2021-2024\n 2025.10.01\n ffe7293\n Released April 08, 2025\n Notes\n Gen 2\n 2025+\n 2025.10.30\n 54f9030\n Released May 24, 2025\n Notes\n 2025.10.30\n 2df0d8a\n Released April 08, 2025\n Notes\n This action cannot be undone.\n Cancel\n Confirm",
  "crawledAt": "2026-02-15T20:34:43.367Z"
}