{
  "url": "https://riviantrackr.com/news/rivian-q4-2025-r2-on-track-software-surges",
  "path": "/news/rivian-q4-2025-r2-on-track-software-surges",
  "title": "Rivian Q4 2025: R2 On Track, Software Surges",
  "text": "Skip to content\nRivian’s Q4 2025 shareholder letter wasn’t just another earnings recap. It felt like a “here’s where we’re really headed” moment. Yes, the numbers matter, and we’ll get to those, but the bigger story is this: R2 is on track, autonomy is becoming core to the company’s identity, and software is starting to matter a lot more than most people realize.\nFirst, R2. Deliveries are expected to begin in Q2 2026, and Rivian already completed its first manufacturing validation builds at the expanded Normal plant. The 1.1 million square foot expansion is done, tooling is in place, and things are moving. The launch version will be a Dual Motor AWD model doing 0 to 60 in 3.6 seconds with over 300 miles of range. That’s not some stripped down “entry” EV. That’s quick, capable, and aimed directly at the high volume midsize crossover segment where the average new vehicle price in the U.S. is just over $50,000. In other words, this is mainstream territory. R1 proved Rivian could build something special. R2 has to prove Rivian can scale.\nAutonomy is also clearly not an afterthought anymore. Rivian’s third generation autonomy platform, launching with R2 in late 2026, will use 11 cameras, 5 radars, and 1 LiDAR, powered by two in house RAP1 chips delivering a combined 1,600 TOPS of compute. That’s serious hardware. They’re building their own silicon, controlling the stack, and leaning into vertical integration in a big way. Universal Hands Free now works across 3.5 million miles of roads, and Autonomy+ is officially $2,500 one time or $49.99 per month. This is Rivian slowly building a recurring revenue layer on top of the vehicles.\nNow the money side. Software and services revenue hit $447 million in Q4, up 109% year over year. It generated $179 million in gross profit in the quarter. Automotive gross profit? Negative $59 million. That’s the quiet shift happening here. Software and services, including the Volkswagen joint venture, are helping carry the business while automotive margins are still being fixed. For the full year, automotive gross profit improved massively to negative $432 million compared to negative $1.207 billion in 2024. They also cut over $7,200 in cost per vehicle versus Q4 2024. It’s not profitable yet, but the direction is finally starting to look healthier.\nRivian produced just over 42,000 vehicles in 2025 and delivered just over 42,000. For 2026, they’re guiding 62,000 to 67,000 deliveries. Adjusted EBITDA is still projected to be deeply negative, between negative $2.10 billion and negative $1.80 billion, so this is still an investment phase. They ended the year with just over $6 billion in cash and $6.6 billion in total liquidity, so there’s runway, but R2 execution really matters now.\nCommercial vans continue to provide stability, with over 30,000 EDVs deployed with Amazon, and Rivian’s Adventure Network keeps expanding with more than 930 chargers and strong uptime. Those pieces are steady. But the real story is bigger than any single quarter.\nR2 is the pivot. Autonomy is becoming foundational, not optional. Software is no longer just a side revenue stream. And 2026 is about proving that Rivian can move from premium niche player to scaled contender without blowing up the balance sheet in the process.\nIf R2 lands cleanly, this company looks very different a couple of years from now. If it doesn’t, the pressure ramps up fast. That’s why this next chapter might be the most important one Rivian has faced so far.\n Leave a ReplyCancel ReplyYour email address will not be published. Required fields are marked *\n Name  *\n Email  *\n Add Comment *\n Save my name and email in this browser for the next time I comment.Post Comment \nΔ",
  "crawledAt": "2026-02-19T03:37:05.188Z"
}