{
  "url": "https://www.rivianroamer.com/software-updates",
  "path": "/software-updates",
  "title": "Rivian Software Updates | Release Tracker | Rivian Roamer",
  "text": "Fleet Status\n Live tracking 6,200+ vehicles\n 2026.03\n (0%)\n • Upcoming\n 2025.46\n (99%)\n Other (1%)\n Rivian Software Update 2026.03\n Cold Snap\n Upcoming\n Upcoming\n UPDATE HIGHLIGHTS\n Cold Weather ImprovementsWe have made several improvements to give you better visibility into how cold weather can affect your vehicle range and what you can do to manage it.The vehicle and the Rivian mobile app now let you know when, and by how much, your range is affected by cold weather.The driver display, Energy app, and Rivian mobile app include a battery graphic that uses blue shading to indicate how much energy is temporarily unavailable.The vehicle and the Rivian mobile app provide preemptive notifications when your vehicle is most susceptible to range loss and when your range has reduced due to the battery becoming cold.When your range is impacted or may become impacted, you can open a guide in the Rivian mobile app which provides insight on improving your experience in cold weather. It includes information on how to recover range due to cold and other useful tips, like scheduling your drive, using Snow mode, and conditioning the cabin before driving. You can also access the guide in the support articles at rivian.com/support.We improved charging logic to better prepare the battery pack for your next drive and help recover energy more predictably.Note: Cold-weather and range loss notifications require version 3.9 or later of the Rivian mobile app.Apple Watch AppThe latest Rivian mobile app update includes a companion app for your Apple Watch. This allows you to remotely access and control your vehicle from your Apple Watch.Gen 2: Access to your vehicle is easy: passive entry is automatically enabled if your digital key is set up. Walk up to your vehicle, and it automatically unlocks as you approach. Then you can start to drive.Gen 1: Access to your vehicle is easy: you can lock or unlock your vehicle with a tap of the Lock icon. With the app open, you can start to drive.You can also use the Apple Watch app to lock or unlock your doors, vent your windows, or sound the alarm, all with a simple tap on your wrist. For even more control, use the digital crown to set a target state of charge or adjust the cabin temperature. Additionally, the app's customizable design lets you choose up to four quick controls for instant access to the features you use most. Go to the Owner's Guide on the center display for more information about all the Apple Watch app has to offer.Note: The Apple Watch app requires version 3.9 or later of the Rivian mobile app. Gen 1 owners must foreground the Apple Watch app to ensure that your Apple Watch can be used as a key for your Rivian vehicle.Exciting New Updates for Drive ModesWe further enhanced the driving experience:Gen 2: Performance Dual-Motor now offers Launch mode, which is designed for use on a closed circuit track in dry road conditions and provides racing stats for 0-to-60 mph (0-to-100 km/h) and quarter-mile race times, along with visualizations and driver coaching. Go to Drive Modes and choose Sport mode on the center display. Then choose Launch mode and follow the on-screen instructions. For more information and important warnings, go to the Owner's Guide and search for Launch mode.Gen 1: Performance Dual-Motor and Quad-Motor now offer Launch mode, which is designed for use on a closed circuit track in dry road conditions and provides racing stats for 0-to-60 mph (0-to-100 km/h) and quarter-mile race times, along with visualizations and driver coaching. Go to Drive Modes and choose Sport mode on the center display. Then choose Launch mode and follow the on-screen instructions. For more information and important warnings, go to the Owner's Guide and search for Launch mode.Sport mode is now available on all Dual-Motor variants. Sport mode prioritizes on-road vehicle performance and optimizes responsiveness and handling in all-wheel drive.Sport mode now offers Standard ride height.Sport mode now offers Firm and Moderate ride feel settings to more accurately reflect the vehicle's performance.Gen 2: For Quad-Motor and Tri-Motor, we have increased the top speed in Rock Crawl mode to 33 mph (53 km/h) to enable more usability between obstacles on trail.Gen 1: For Quad-Motor, we have increased the top speed in Rock Crawl mode to 33 mph (53 km/h) to enable more usability between obstacles on trail.Gen 2: You can now change between all on-road drive modes and adjust ride height, ride feel, and brake regen settings while Adaptive Cruise Control and Universal Hands-Free are engaged.Gen 1: You can now change between all on-road drive modes and adjust ride height, ride feel, and brake regen settings while Adaptive Cruise Control and Highway Assist are engaged.Enhanced Kneel ModeGetting in and out of your vehicle just got a whole lot smoother. We've redesigned Kneel Mode to be more responsive, more accessible, and available exactly when you need it.Your vehicle will now lower even further in Kneel Mode, making it easier than ever to enter, exit, or load gear.We've re-engineered our algorithms so your vehicle can now kneel from High ride height and across all on-road drive modes, including All-Purpose, Sport, Conserve, and Snow.You can now trigger Kneel Mode on demand via a new Quick Control option to activate the lowering process while traveling at low speeds, less than 20 mph (32 km/h).If Kneel Mode isn't available due to specific conditions, we'll let you know why. If the Kneel icon is greyed out in your Quick Controls, simply choose it to learn more about why Kneel is unavailable.Thanks, Cambry, for the feedback!Unreal Engine 5 UpgradeWe upgraded our software to use Unreal Engine 5.5 for the three-dimensional renderings shown on the driver and center displays, including the Autonomy view (Gen 2) / Driver Assistance view (Gen 1) and apps such as Drive Modes and Settings. Improvements include better anti-aliasing, smoother animations, and increased capability to render a larger number of surrounding vehicles, bicycles, and pedestrians on the driver display.Additional ImprovementsFlorida Power & Light FPL EVolution charging locations with real-time status and speed information now appear in maps and navigation.InfotainmentFixed an issue that caused the FM radio to be stuck in a reconnecting state.Addressed several display and layout issues on the Drive Modes Gauges view.Fixed an issue that caused the infotainment system to crash when you swiped on the Drive Modes screen.General stability and performance enhancements.Gen 2 ExclusiveFixed an issue that caused Universal Hands-Free to issue take over requests when approaching toll gantries.Fixed an issue that caused Universal Hands-Free to not automatically re-engage after a manual lane change.Advanced the timing of notifications when approaching traffic lights and stop signs while Universal Hands-Free is active.Updated notifications for Universal Hands-Free.Fixed an issue that deployed door handles when the vehicle switched from Drive to Park when Car Wash mode is active.Fixed an issue that kept rearview guidelines and camera buttons from appearing in live camera views on the center display.\n View Details\n Rivian Software Update 2025.46\n Wide Open\n Released December 18, 2025\n UPDATE HIGHLIGHTS\n Driver Display Now Customizable\n You can now switch between the Driver Assistance view, which shows vehicles and objects up ahead, and the Maps and Navigation view on the driver\n display. Press the right thumbwheel on the steering wheel to swap.\n Note: While showing the Maps and Navigation view, the driver display automatically switches back to the Driver Assistance view if\n you engage Highway Assist, or if the Park Assist sensors are triggered.\n Navigation\n When the vehicle isn't following a route, Navigation now zooms out on the map and shows more geographical context, such as buildings and parking\n lots.\n At the start of a route, you now have a brief window to select alternate routes after you choose the Home button, the Work button, or Go on a\n search item.\n We improved the loading performance of the Navigation app.\n Additional Improvements\n Improved drive mode behavior by saving the selected Regen setting per drive mode.\n Improved the loading performance of SiriusXM.\n Improved passive entry performance with the iPhone 17.\n Fixed a rare issue that kept the liftgate from closing properly.\n Gen 2 Exclusive\n Universal Hands-Free\n Universal Hands-Free steers, accelerates, and brakes your vehicle on roads with marked lanes, allowing you to let go of the steering wheel for\n extended periods, as long as you're looking at the road. Universal Hands-Free is now available on more than 3.5 million miles (5.6 million km) of\n roads in North America and relies on Driver Attention Detection to confirm that you're paying attention to the road ahead of you.\n When Universal Hands-Free is available on a marked road as indicated by the Universal Hands-Free icon near the speedometer, pull the drive stalk\n towards you twice to activate Universal Hands-Free.\n System Limitations:\n Universal Hands-Free is an advanced driver assistance feature designed to support the driver, but doesn't replace the driver's attention,\n judgment, and need to control the vehicle.\n Universal Hands-Free doesn't make your vehicle autonomous or self-driving. Stay alert at all times of road conditions. Always be prepared to\n take control of the vehicle if needed.\n Universal Hands-Free doesn't automatically stop at traffic lights and stop signs. Notifications may appear, and you must take the appropriate\n action in these scenarios. It is your responsibility to follow traffic laws.\n Universal Hands-Free doesn't update the set speed automatically as the speed limits change. It is your responsibility to monitor the posted\n speed limits and adjust the set speed.\n Universal Hands-Free doesn't make turns or follow navigation instructions. If you're in a turn-only lane, you must take control of the vehicle\n and steer it appropriately.\n Don't use Universal Hands-Free on slippery, unpaved, wet, or snowy roads.\n Universal Hands-Free won't do the following:\n Drive the vehicle through high curvature roads such as roundabouts and sharp turns.\n Detect special-use lanes such as bike lanes, bus lanes, and emergency lanes.\n Detect and react to oncoming or crossing vehicles, uncommon objects, or odd-shaped objects including, but not limited to, open doors,\n barrels, poles, debris, and trailers.\n React promptly to road users around blind corners, crossing intersections, and narrow driving situations.\n Slow down or stop for speed bumps, dips, upcoming traffic lights, or stop signs.\n Steer in response to temporary lane lines marked by cones, barrels, or similar construction materials.\n React to special crossing scenarios such as railway crossings.\n Follow navigation prompts or make turns in turn lanes.\n Autonomy Drive Styles\n Autonomy Drive Styles allow you to customize the driving behavior of our driver assistance systems and features: Universal Hands-Free, Highway\n Assist, Adaptive Cruise Control, and Lane Change on Command.\n Choose Mild for a relaxed style with more gap distance and more gradual lane changes.\n Choose Medium for a balanced style to manage cut-ins and accelerate with traffic flow.\n Choose Spicy for a more dynamic style with a tighter gap distance and quicker steering during lane changes.\n To change Drive Styles while you drive, press the thumb control buttons on the right side of the steering wheel.\n Updated Control to Adjust Speed\n To adjust speed while in Universal Hands-Free, Highway Assist, or Adaptive Cruise Control, roll the right thumbwheel up or down on the steering\n wheel.\n Enhanced Autonomy View\n The Autonomy View now zooms out to show more of the area behind your vehicle, so you have more context for maneuvers such as lane changes and\n turns.\n Rivian Digital Key\n Use the new digital key through the native Wallet app on your iPhone and Apple Watch, Google Pixel, or Samsung device to seamlessly access and\n drive your vehicle. Digital key offers these benefits:\n Greater reliability for passive entry.\n Enhanced accuracy and security with the use of UWB (Ultra Wide Band) technology.\n Improved interoperability across devices.\n Ability to easily share up to 8 keys with family and friends.\n Vehicle access via NFC (Near Field Communications) for up to 5 hours after your phone runs out of battery power.\n Digital key is available with the vehicle software version 2025.46 or later and the Rivian mobile app version 3.8.0 or later.\n RAD Tuner Drive Mode: Create, Customize, Curate\n The Rivian Adventure Department (RAD) brings you RAD Tuner, which was developed by the team behind our historic wins at Rebelle Rally and Pikes\n Peak International Hill Climb.\n Exclusive to Quad-Motor vehicles, this feature allows you to go beyond the factory presets and optimize the vehicle's dynamic behavior for your\n preferences and the terrain. Use intuitive touch sliders to build and save custom drive modes by adjusting these independent settings:\n Acceleration\n Regen\n Brake assist\n Steering assist\n Ride height\n Torque balance\n Wheel slip\n Stability\n Damping\n Roll stiffness\n Introducing Kick Turn\n For Quad-Motor vehicles only, boost its off-road agility with Kick Turn. By leveraging the power of all four motors working together, your vehicle\n can now rotate in place or significantly reduce its turning radius while moving at speeds under 15 mph (24 km/h).\n Whether you are navigating a tight hairpin, tackling a switchback, or turning around on a blocked trail, you can now pivot precisely where you need\n to go. No more 3-point turns—go off-road and kick it responsibly.\n Enhanced Throttle Control\n Enhanced throttle control for more responsive vehicle handling in the Soft Sand, Rally, and Drift modes, if available. The accelerator pedal offers\n more precise control in the less restrictive Stability settings, Reduced and Off, so you have finer control to adjust wheel slip and vehicle attitude\n (its orientation in space).\n Charging\n Improved stability of AC charging.\n Improved robustness of AC charging in cold weather conditions.\n Additional Gen 2 Fixes\n Fixed a rare issue that affected 12 V battery health in cold weather.\n Gen 1 Exclusive\n Charging\n Fixed an issue that kept the vehicle from charging on the set schedule.\n Fixed an issue that prevented charging from ending when you pressed the charge port button to stop the charging session and the schedule was\n active.\n Fixed issues that prevented the charger handle from being unplugged after DC fast charging ended.\n Fixed an issue that impacted the charge port indicator and the in-vehicle charge status display.\n Additional Gen 1 Fixes\n Fixed an issue that disabled phone proximity features in rare conditions.\n Fixed an issue that prevented the Rivian mobile app from updating the current drive mode.\n Fixed a rare issue that caused the 12 V battery to drain when the vehicle woke from sleep.\n View Details\n Rivian Software Update 2025.38\n Spooky Swamp\n Released October 21, 2025\n UPDATE HIGHLIGHTS\n Happy Haunting!If you dare, gather your family and friends for some Halloween frights and fun! Touch the eerie scene in the All-Purpose drive mode screen on the center display. Can you find what’s lurking? Dress your car up in its costume to enter a world of spooky images, foreboding sounds, and ghastly lights! Is that a frog I hear? Yikes! A swamp monster!To don the costume:Update the Rivian mobile app on your phone to version 3.6.0.Place the vehicle in P (Park), and make sure it has more than 30 miles of range.Turn off Pet Comfort and Vehicle Shipping mode (if they’re on).Make sure to have WiFi or cellular reception on the vehicle and on your phone.Tap Let's Get Spooky on the main screen of the Rivian mobile app to dive in!NOTESWhile car costume is on, passive entry and the horn are disabled, and range decreases slightly.Car costume stays on after you leave the vehicle, so turn it off through the mobile app (or press the brake pedal) if you want to preserve the vehicle battery.Climate ImprovementsClimate Hold is a new setting that runs the climate system for a set amount of time after you exit the vehicle, maintaining cabin temperatures while you're away, and keeping any remaining occupants comfortable. Use the Rivian mobile app to monitor climate status, the Hold time remaining, and to turn Hold on or off.DANGER: Never leave a child unattended in the vehicle.NOTE: When leaving pets alone in the vehicle, use Pet Comfort instead of Hold as it has specific behaviors meant to keep your pets as safe and comfortable as possible.Auto cabin ventilation is a new setting that automatically blows ambient air into the parked vehicle on warm days to help prevent extremely high temperatures in the cabin. This feature is on by default, and notifies you in the Rivian mobile app when it's running. You can turn it on or off in the mobile app.Auto air recirculation now appears as an option when you cycle through the Air Recirculation settings in the center display. When in Auto air recirculation mode, the system automatically switches between pulling in outside air and recirculating cabin air to optimize comfort, cabin air quality, and energy efficiency.Plug and Charge Available with Electrify America and IONNA ChargersFor Electrify America and IONNA chargers, you can now:Check live charger status and speeds on the in-vehicle Navigation map.Automatically plug and charge (with a valid credit card attached to your Rivian account).Filter for IONNA chargers and select them in Trip Preferences > Preferred Networks.App Launcher ImprovementTo enhance convenience and usability, you can now more easily customize the app launcher at the bottom of the center display. By default, your favorite and most recent apps appear. Choose More to access other apps, and press and hold an app icon to move it to a different location in the launcher.Additional ImprovementsImproved the reliability of the touch sensor on the driver door handle for tap to unlock (Gen 2).Added the ability to press and hold Volume on the bottom of the center display to mute and unmute the current audio source.NavigationUpdated zoom behavior, including adjusted the zoom in on maneuvers to show more of the map.Improved traffic and incident updates for trips with multiple stops.CampingImproved leveling by allowing you to reposition the vehicle during the leveling process without having to reset the ride height. Leveling now pauses when you shift into D (Drive) or R (Reverse) and slowly move the vehicle, and it resumes when you shift the vehicle back into P (Park). (Thanks, u/Adorable_Wolf_8387, for the report.)Reduced the amount of time it takes for the vehicle to enter and exit the leveling process.Gear GuardFixed an issue that caused a five-minute delay when you opened the Incidents tab, clicked on an Incident notification, and waited for the list of available Incident videos to appear.Fixed an issue that prevented the system from identifying a USB device after a sleep cycle, requiring you to remove and reinsert the device.Fixed an issue during USB device setup that would prompt you to shift the vehicle into P (Park) when the vehicle was already parked (Gen 2).Fixed an issue that prevented Incident video thumbnails from appearing on the Gear Guard app, even though cameras had properly recorded the videos (Gen 2).Fixed an issue that prevented the Gear Guard animation from playing on the center display while video recording was in progress.Fixed an issue related to casting certain Digital Rights Management (DRM) protected content. A re-acceptance of Google Cast terms is required as part of the fix.Fixed a rare issue that caused the alarm to sound when passive entry was used to open the Gear Tunnel (Gen 1, R1T).Fixed a rare issue that caused the alarm to sound when passive entry was used to open the liftgate (Gen 1, R1S).Fixed an issue that caused the garage door pairing menu notification to appear on top of the reverse camera screen.Fixed a rare issue that caused the Phone app to show a Sync Contacts prompt in the center display prior to allowing a call through Bluetooth®.Battery and ChargingImproved 12 V battery health detection, which now includes in-vehicle and mobile app notifications to alert you when the 12 V battery needs to be replaced.Improved the triggering of low-range battery notifications on the Rivian mobile app when the vehicle is asleep (Gen 2).Fixed a rare issue that caused the displayed range and state-of-charge (SOC) to quickly increase a few percentages at charging start.Fixed a rare issue that caused incorrect charging costs to appear in the Rivian mobile app.Fixed an issue that prevented the vehicle from charging over the weekend when the custom charging schedule was set as Weekdays.Fixed a rare issue that caused the 12 V battery to drain when the vehicle woke from sleep.Fixed an issue that disabled phone proximity features in rare conditions.Fixed an issue that prevented the Rivian mobile app from updating the current drive mode.Fixed some rare issues that caused fast-charging failures.Fixed an issue that impacted the charge port indicator and the in-vehicle charge status display.\n View Details\n Rivian Software Update 2025.34\n Energy Unlocked\n Released September 25, 2025\n UPDATE HIGHLIGHTS\n Enhanced Highway Assist Improvements (Gen 2)The new Co-Steer feature allows you to adjust your position within a lane using gentle steering inputs while Highway Assist is active without the system disengaging. Co-Steer enables you to make adjustments within the lane in certain situations, like driving beside barriers or passing a semi-truck in an adjacent lane. This feature provides you with collaborative steering while using Highway Assist.The availability of Enhanced Highway Assist has increased by up to 50%, particularly on urban and suburban highways.Introduced a new perception model that improves lane centering performance, especially in moderate to tight curves.Smart Charging Schedule RecommendationYour Rivian can now automatically charge at home during off-peak times when electricity is typically cheaper, cleaner, and more reliable, while still ensuring your vehicle is ready when you need it. This smart scheduling can cut annual home charging costs by 20% or more and increase your use of clean energy. Enable this feature for effortless savings, reduced emissions, and a better balance for the grid, all handled seamlessly through your Rivian mobile app (version 3.5 or later).Enhanced Audio SettingsTo optimize your listening experience, you can now save custom versions of each equalizer profile. Plus, we've added two additional custom slots that you can also rename.Additional ImprovementsAudio Improvements (Gen 2)Fine-tuned equalization and delays to make the bass feel richer and more impactful.Soundstage improvements for better localization, separation, and layering.Improved blending of Dolby Atmos® content for all listening positions.Performance ImprovementsUpdated and improved media apps, including increased touchscreen responsiveness.Improved Navigation stability and responsiveness.Improved responsiveness to mobile commands while vehicle is asleep.Resolved a rare issue that prevented users from accepting the terms of service for Rivian Navigation with Google Maps.Fixed an issue that kept Gear Guard video thumbnails from displaying properly on the Motion Cam and Incidents screens.Resolved a rare issue where the tonneau cover position was displayed incorrectly on certain screens. (Gen 1, R1T)Resolved a rare issue that caused fog lights to turn off and exterior lighting to revert to Auto mode. (Gen 1)Fixed an issue that caused trip energy and efficiency data to fluctuate unexpectedly.Made improvements to the accuracy of battery range on arrival estimates, including adding location air density as a factor for locations at higherelevations.Resolved a rare issue that prevented the door handles from presenting for an unlock request while Car Wash mode is active. (Gen 2)Reduced excessive blower noise during climate control start-up in mild conditions while maintaining cooling performance in extreme temperatures. (Gen 2)Fixed a rare issue that caused cabin conditioning requests initiated from the Rivian mobile app to fail on the first attempt. (Gen 2)Introduced additional improvements for 12 V battery health detection, including in-vehicle and mobile app notifications to alert you when the 12 V battery needs to be replaced. (Gen 2)\n View Details\n Rivian Software Update 2025.26\n Peak Response\n Released August 19, 2025\n UPDATE HIGHLIGHTS\n ImprovementsEnhanced perception upgrades the autonomous and active safety features on R1 Gen 2 vehicles (Gen 2)Improved system performance when sensors are temporarily obstructed by snow, mud, or direct sunlight (Gen 2)Improved detection and quicker reaction times to dynamic traffic conditions, such as cut-ins, merges, and stopped traffic (Gen 2)Expanded vehicle detection across multiple lanes and in cross-traffic, with improved visualizations on the driver display (Gen 2)Reduced number of system disengagements due to poorly marked lanes (Gen 2)Improved the performance and stability of apps on the center displayIn Navigation, improved the stability, usability, and responsiveness to touch gestures, such as swipingFixed an issue that prevented the center display from responding properly to multi-touch gestures after streaming video content protected by Digital Rights Management (DRM) (Thanks, u/SnazzyLabs, for the report.)Alexa now works with YouTube™Fixed an issue in Apple Music that prevented certain users from signing back into the appEnhanced steering calibrations for Sport and Off-Road drive modes to further optimize steering performanceSport drive mode: Maximized tire feedback and enhanced cornering precisionOff-Road drive modes:Reduced steering wheel kickback when you drive over rocky terrainEnhanced steering effort and damping to improve feedback during controlled rotation or drifting over gravelImproved steering torque feedback when you drive over loose surfaces and if wheel slip occursNOTE:All-Purpose, Snow, and Conserve drive modes remain unchanged.Improved cabin climate behavior in humid conditions (Gen 2) (Thanks, u/RivianTrackr, for the report.)Fixed an issue that kept Gear Guard thumbnails and videos from displaying properly on the Motion Cam and Incidents screens (Gen 2)Increased the availability of on-demand battery conditioning when the vehicle battery is lowFixed an issue that caused the \"range is too low\" notification to repeatedly appear during on-demand battery conditioning for DC fast chargingFixed an issue that displayed inaccurate efficiency and energy consumption values for Trips A and B (Gen 2)Improved calibration to display the appropriate seat conditioning iconAdded a way to restart the vehicle to the Settings > Vehicle > Service screen (Gen 2)Reduced active grille shutter noise from the front of the vehicle when it wakes from sleep (Gen 1)\n View Details\n Rivian Software Update 2025.22\n Route Awakening\n Released July 15, 2025\n UPDATE HIGHLIGHTS\n Rivian Navigation with Google MapsWe teamed up with Google Maps to build a navigation product that specifically supports Rivian's EV driver experience.This major release provides the following from Google Maps, both in-vehicle and in the Rivian mobile app:Routes and live trafficReal-time road incidentsTappable points of interest you can select and exploreSearch powered by Google MapsSatellite imagery that refreshes regularly (Connect+ subscription required)The release also includes a new map style, easier access to Home and Work locations, and an option to see range as percentage, distance, or both.Driver Assistance ImprovementsYou can now use Driver Assistance features when an electrical accessory is connected to the tow hitch of your vehicle. To enable this, go to Drive Modes > Trailers and select Accessory.Notes: An accessory is defined as a vehicle attachment that doesn't have an axle and isn't directly supported by the ground. It's your responsibility to select the correct profile when towing a trailer.Driver assistance features may not work as designed if a large electrical accessory is attached in the rear of the vehicle.Go Chime now provides a chime only when Driver Attention Detection confirms the driver is not looking at the road when a vehicle ahead drives away. Go Chime no longer chimes when the Driver Attention Detection feature confirms the driver is looking at the road ahead. (Gen 2)When the vehicle comes to a stop while Adaptive Cruise Control or Highway Assist is engaged, and Driver Attention Detection confirms the driver is looking at the road ahead, the vehicle now extends the active period of the driver assistance feature before pausing. (Gen 2)All New Launch Cam (Gen 2)On Tri- and Quad-Motor vehicles, you can now capture and relive Launch mode events from five camera angles, along with an overlay of a live telemetry feed that includes reaction time, peak G-force, 0-60, and quarter-mile times. To use this feature, go to Video > Launch in the center display, and turn on Record video during launch events.Introducing New Vehicle Dynamics Handling Control Logic (Gen 2)We developed a new control software to allow a greater separation between Ride and Handling maneuvers across all Drive modes, resulting in improved ride comfort on straightaways and improved roll control during cornering. Benefits to Drive modes include:All-Purpose - Reduced ride trade-offs between casual driving and spirited drivingSport - Increased roll damping during sustained corneringRally - Enhanced composure over rough terrain to deliver a more engaging and comfortable driving experienceRock Crawl - Improved body control during low-speed, cross-axle articulation scenariosRivian Adventure NetworkThe Rivian Adventure Network now has off-peak pricing on many sites, offering you the flexibility to save by charging at off-peak hours throughout the day.Additional ImprovementsImproved climate control cool-down speed and steady state comfort in hot weather. (Gen 2)Improved the performance of remote address sharing.Improved the stability of the infotainment system.Improved AC charging stability and fault handling. (Gen 1)Fixed a rare issue that prevented the Apple Music sign-in screen from opening.Fixed a rare issue that caused a power draw after an AC charging session. (Gen 2)Removed the Standard option for High Beams Assist, and renamed the feature Adaptive High Beams Assist. (Thanks RivianRoamer for the report.) (Gen 2)Fixed a rare issue with Multi-factor Drive that allowed drivers to shift the vehicle out of P (Park) without requiring the second factor. (Thanks to Kilowatts for the report.)Fixed an issue that caused a delay when using proximity unlock with an Apple iPhone 14 phone key.In the Energy Monitor tab of the Energy app, fixed an issue that prevented the last unit selection from persisting. (Thanks, u/caj_account, for the report.)Fixed an issue in the Energy Monitor tab of the Energy app session details for Park and Drive that will cause charging, park, and drive session data to reset during this software update.Fixed an issue that caused an erroneous pre-conditioning not available warning to appear on the charging screen.Fixed an issue on some vehicles that allowed an incorrect backlight brightness to load onto the displays.\n View Details\n Rivian Software Update 2025.18\n Powered Up, Locked Down\n Released June 3, 2025\n UPDATE HIGHLIGHTS\n Multi-factor DriveYou can now enable Multi-factor Drive to require a second form of authentication before starting your vehicle. This industry-leading feature increases the security of your vehicle by requiring you to authenticate each time you drive it.When Multi-factor Drive is enabled and you press the brake to shift out of P (Park), a notification appears on the center display. Then you can authenticate from the Rivian mobile app, version 3.1 or later, or via the actionable notification on your smartwatch. If you do not receive the notification, you can also enter a time-based passcode that displays on your smartphone.To enable Multi-factor Drive, log in to the primary owner account in the Rivian mobile app, go to Security and access, and turn on Multi-factor Drive.NOTEOnly a vehicle owner can enable or disable Multi-factor Drive. The setting applies to all drivers and keys associated with the vehicle.When Multi-factor Drive is enabled, a driver won't be able to drive the vehicle using the key fob or key card without authentication.To approve a drive, the driver must have a Rivian account associated with the key and the key must be paired with the vehicle.As a backup option, the driver can also access a time-based passcode on their smartphone. Go to Security and access and choose View time-based passcode.To use Multi-factor Drive, all drivers must have the Rivian mobile app version 3.1 or later installed on their smartphone.New Rivian Energy AppThe new Rivian Energy app introduces features and improvements to increase your understanding and control over your vehicle's energy consumption while driving, parked, or charging. In addition, you can now precondition your battery on demand for fast charging and view your charge curve in the vehicle with improved charge time accuracy. This can help with trip planning and provide greater peace of mind by making your energy usage easier to understand and visualize.Energy Monitor TabProjected range impact: Increase your understanding of your actual energy consumption versus what's expected while driving and while in P (Park). You can gain insight into how your driving behavior affects your range and get useful driving tips. You can also view your parked energy usage on the Rivian mobile app.Usage: Dive deep into your energy usage over selectable timeframes.Session details: View a comprehensive distribution of systems in your vehicle that are consuming energy, including Gear Guard, outlets, and climate.Charging TabGraph: Visualize your active or latest charging session with an interactive graph.Target level for charging stops: When using navigation for a trip that includes a charging stop, now it's easy to see the recommended charge target for your trip from the vehicle or the Rivian mobile app. Simply start your charge, and the app will calculate and notify you (both in the vehicle and on the Rivian mobile app) when you've reached the ideal charge level for your trip.On-demand battery preconditioning: Precondition your battery on demand for fast charging. The system heats or cools the battery to the optimal temperature for fast charging.View the new Energy app on your center display and on the Rivian mobile app, version 3.1 or later.Charging ImprovementsWe've improved DC fast charging performance and consistency for Max pack batteries (Gen 1) and all battery pack variants (Gen 2). These improvements provide better charge times and expanded capability across a larger range of temperatures.Max Pack: Optimized charging algorithms to reduce the time required when charging the battery from 10% to 80%.Standard Pack (Gen 2): Optimized charging algorithms to reduce the time required when charging the battery from 10% to 80%.Large Pack (Gen 2): Optimized charging algorithms to:Improve peak charge rate.Reduce the time required when charging the battery from 10% to 80%.Increase the number of miles added in the first 15 minutes of charging.Additional ImprovementsEnhanced the vehicle visualizations with new, more detailed vehicle models on the driver display.Enhanced the driver display to show a greater number of vehicles across five lanes and in more diverse situations, such as cross-traffic, oncoming traffic, and parked vehicles (Gen 2).Improved the responsiveness of Go Chime, resulting in fewer extraneous chimes (Gen 1).Improved the stability and responsiveness of the infotainment system.Improved the performance and stability of media apps.Optimized low voltage battery management to improve long-term battery health (Gen 2).Fixed a rare issue that caused camera views and recorded videos to be unavailable in the Gear Guard app (Gen 2).\n View Details\n Rivian Software Update 2025.14\n AI DJ & RAP Updates\n Released May 6, 2025\n UPDATE HIGHLIGHTS\n InfotainmentSpotify DJ delivers AI-based song recommendations with artist commentary and background informationMedia app remembers recent searches in Apple Music and Spotify when switching between driver profilesResolved authentication issues preventing Apple Music account accessFixed volume control problems affecting Alexa voice commandsFaster infotainment app switching and improved climate control app loading timesDriver AssistanceHighway Assist now receives automatic updates for road construction, speed limits, and safety optimizations via Wi-Fi (Gen 1)Go Chime feature refined to reduce unnecessary alerts while maintaining traffic movement notifications (Gen 2)Vehicle ControlsTri-Motor vehicles maintain disabled Auto Ride Height setting and Sport mode after sleep cycles (Gen 2)Fixed issue causing delayed suspension raising after vehicle wakes from sleepComfort & ConvenienceDriver profiles now save personal navigation destinations and display preferences for customized experienceResolved rare climate control failure that prevented cabin heating in cold weather conditions (Gen 2)Fixed user-reported misalignment between vehicle image and quick control buttonsConnectivityImproved network transition providing seamless handoff from Wi-Fi to cellular when driving away from connected networksEnhanced reliability of proximity-based locking and unlocking functions (Gen 2)Resolved rare bug preventing driver-side door from unlocking after vehicle wakes from sleep (Gen 2)System ImprovementsAdded notification on center display when vehicle cannot access internally stored video recordings (Gen 2)\n View Details\n Rivian Software Update 2025.10\n Gen 1 RAP & Watchful Gear Guard\n Released April 8, 2025\n UPDATE HIGHLIGHTS\n Driver Assistance• Smart Turn Signal Automation automatically turns off your turn signal after completing a manual lane change on highways. (Gen 1)• New Go Chime Feature alerts you when traffic ahead begins moving while you're stopped. This feature is on by default but can be disabled in Settings. (Gen 1)Vehicle Controls• Smoother Low-Speed Driving significantly reduces vehicle rocking when crossing diagonal speed bumps, parking lot entrances, and asymmetric road features for a more comfortable ride.Adventure• Tonneau Cover Fix resolves issues preventing version 2 of the powered tonneau cover from opening in certain scenarios. (Gen 2)Safety & Security• Enhanced Gear Guard Detection now records video when objects—not just people—are detected near your vehicle.• Critical Tire Pressure Alerts notify you when tire pressure drops to potentially unsafe levels.Infotainment• Expanded SiriusXM Features include dual-stream support for live sports games and direct channel access through Alexa.• Improved Media Management with better scrolling through large Apple Music playlists and enhanced YouTube search and playback controls.Range & Charging• Faster Cold Weather Charging reduces Level 2 charging times in below-freezing temperatures.• Range Display Accuracy fixes calibration issues that caused parked Dual Standard vehicles to show greater than actual range loss. (Gen 2)• Energy Conservation reduces vehicle range loss when 12V battery health is low and minimizes energy use when keys are left near the vehicle. (Gen 2)Comfort & Convenience• Improved Phone Key Response makes locking and unlocking more responsive and fixes pairing issues for Android phones. (Gen 2)• Less Intrusive Notifications reduces the frequency of unbuckled occupant alerts for a better driving experience. (Gen 2)• System Reliability Upgrades improve overall responsiveness, Wi-Fi self-recovery, and fix clock display issues on the rear screen.\n View Details\n Rivian Software Update 2025.06\n Highway Assist & Wheel Swap\n Released March 11, 2025\n UPDATE HIGHLIGHTS\n ✨ Major FeaturesEnhanced Highway Assist allows hands-free driving with Driver Attention Detection [Gen 2]New Go Chime feature alerts you when vehicle ahead drives away [Gen 2]Wheel and Tire Swap feature allows saving up to six configurations with accurate range estimatesNew Rally drive mode added for Performance Dual-Motor vehiclesPerformance Upgrade now available for purchase on eligible Dual-Motor vehicles, adding Sport, Soft Sand, and Rally modesAuto-Tilting Side Mirrors in Reverse feature added (disabled by default)📱 Mobile App Enhancements (v2.20.0+)Remote charge port door control without unlocking vehicleReal-time destination and ETA updates while navigatingView current wheel and tire configuration in Vehicle Health section🔊 Sound System Improvements [Gen 2]Improved spatial imaging (sound source reproduction)Enhanced low-frequency (bass) responseBetter sound balance between front and rear cabin🚘 Driver Assistance & DisplayEnhanced Highway Assist with Driver Attention Detection enabled by default [Gen 2]Added small SUV visualizations to enhance surrounding vehicle display [Gen 2]Fixed occasional issue limiting Highway Assist availability in valid lanes [Gen 2]Added cold weather range impact notificationsAdded real-time tire pressure notificationsFixed Efficiency graph stuttering during notificationsFixed camera view blocking \"Take control\" notificationsFixed sizing issues with panels on left side of driver displayFixed overlapping phone and media panels issue🔋 Charging & EfficiencyFaster charging status updates on driver display [Gen 2]Fixed rare system fault during DC fast charging [Gen 2]Improved vehicle battery efficiency while parkedFixed rare battery preconditioning issue for Climate Schedule [Gen 2]📷 Camera Improvements [Gen 2]Fixed front camera display issue at low speeds near objectsFixed rare issue with unavailable surround cameras after sleep🔌 Connectivity & AccessEnhanced Wi-Fi roaming performance between networksFixed issue causing vehicle to connect to its own Wi-Fi hotspotFixed incorrect maximum hotspot connections displayImproved proximity unlocking responsiveness with phone keyFixed issue preventing phone key setup [Gen 2]Fixed issue with locked rear display unlocking after sleep [Gen 2]🎵 Media & InfotainmentFixed Apple Music playback issues for certain accountsFixed volume level increase after vehicle wakes from sleepImproved overall infotainment system stability❄️ Climate ControlFixed issue incorrectly indicating defrost is faulty [Gen 2]Improved Roomy entry/exit behavior after vehicle wakes from sleep\n View Details\n Rivian Software Update 2024.51\n Rise & Shine\n Released January 23, 2025\n UPDATE HIGHLIGHTS\n ✨ Major FeaturesSmart Turn Signal automatically turns off after manual lane changes on highways [Gen 2 only]Vehicle displays now show instructions to disable alarm when triggeredNavigation favorites (work, saved locations, recent destinations) now sync with driver profiles and mobile app🔋 Power & EfficiencyImproved charging efficiency for Dual-Motor Large and Max pack batteries [Gen 2]Better drive efficiency in mild to cold conditions [Gen 2]Enhanced \"Ready\" state efficiency with no driver presentVehicle now sleeps after 60 seconds if charger is improperly plugged inVehicle can now sleep even with driver seatbelt buckled❄️ Cold WeatherFront fascia heating added for sensor performance in cold conditions [Gen 2]Extended defrost time during pre-conditioning via mobile app [Gen 2]🚘 Driver AssistanceFixed rare Adaptive High Beams failure issue [Gen 2]Resolved driver assistance features unavailability after wake cycles [Gen 2]Fixed redundant \"Surround Sensor Unavailable\" notifications [Gen 2]🎵 Apple Music & AudioFixed volume fluctuation between Dolby Atmos and stereo tracksResolved playback issues preventing songs from playingFixed \"See All\" button for Live Radio entriesAdded day/night modes for settings and sign-in pages📱 Mobile & ConnectivityThird-row seat heating can now be added to climate schedules [Gen 2]Fixed rare issue blocking remote commands (requires phone key re-pairing)Improved drivability and control in Reverse🐞 Bug FixesFixed issue with Dual-Motor vehicles getting stuck in non-existent Conserve modeResolved passenger window false obstruction detection [Gen 2]Fixed infotainment reboot during Google Cast streaming [Gen 2]Fixed rear display touch response issues [Gen 2]Enhanced overall infotainment system stability\n View Details\n Rivian Software Update 2024.47\n Holiday Casting\n Released December 18, 2024\n UPDATE HIGHLIGHTS\n 🎁 Holiday CheerJingle sound and twinkling front and rear lights ([Gen 1] green, [Gen 2] red & green) when locking your vehicleA merry snowman ☃️ and festive pine trees 🌲 can be seen in snow mode📺 Casting & MediaYou can now view Google Cast and YouTube content via the new Video app built into the center screen. Available to everyone as a preview.🌡️ Climate & HVACSmart seat climate icons automatically switch between Heat and Ventilate based on outside temperature🤖 Driver AssistanceNew chevron icons show curve slowdowns during ACC/Highway AssistImproved 360° visualizations for parked and stopped vehicles2️⃣ Gen 2 UpdatesSupport for adding key fob via app 2.16+Better DC fast charging for Large/Max pack batteriesImproved acceleration response in All-Purpose for Tri MotorImproved cabin heating performance🐞 Bug Fixes & ImprovementsImproved ride height adjustments on uneven terrainResolved charging interruption problemsGear Guard will use HV battery instead of 12V to improve 12V battery healthTurn signals now take priority over hazard lights\n View Details\n Rivian Software Update 2024.43\n Audio Profile Linking\n Released November 22, 2024\n UPDATE HIGHLIGHTS\n New Audio FeaturesNew lock sounds: Choose between bluebird chirp or owl hootDay/Night setting automatically switches between soundsFixed Apple Music audio playback issueDriver Profile ImprovementsMedia streaming accounts now link to driver profilesAutomatically loads personal media, climate, and driver assistance settingsSaves vent positions, presets, and auto mode statusNavigation & AIAdded Google Gemini AI summaries for places (Connect+ feature)Fixed garage door opener display issuesClimate Control UpdatesTemperature controls convert to fan speed controls when AC is offImproved airflow visualization with color-coded temperature indicatorsEnhanced fan speed control consistencyGear Guard ImprovementsBetter notifications for hard drive storageFixed streaming issuesOther FixesResolved TPMS display inconsistenciesSmoother transitions for driver display objectsGeneral infotainment stability improvementsBetter auxiliary air compressor behavior\n View Details\n Rivian Software Update 2024.39\n Halloween Mode\n UPDATE HIGHLIGHTS\n 1. Halloween Special Features 🎃- Choose from 3 car costumes: K.I.T.T. (Knight Rider), DeLorean time machine, or haunted house- Includes spooky accent lighting and eerie lock sounds- Features 3D surprises2. Driver Display Improvements- New navigation maneuver panel- Improved notifications layout and animations- New phone and media panel in the carousel- Enhanced energy graph and TPMS panels3. Audio Upgrades- TIDAL now supports Dolby Atmos- Fixed various audio issues across platforms- Improved Spotify and Apple Music integration- Better bass response (Gen 2 only)4. Smarter Vehicle Sleep- Vehicle now sleeps within 5 seconds after exit- Works even with fastened unoccupied seatbelts- 1-minute wake window by tapping displays5. Automatic Front Camera in Park Assist- Front camera automatically appears during Park Assist- Helps navigate tight spaces more confidently- Can be disabled in SettingsGen 2 Exclusive Features- Improved Model Predictive Controller (MPC) for smoother Highway Assist steering- Enhanced vehicle detection and visualization- Updated Large+ battery pack charging recommendations (85% or 100%)- Better bass response in audio system- Additional vehicle access safety features (speed-dependent door controls)\n View Details\n Rivian Software Update 2024.35\n Gear Guard Live\n View Details\n This action cannot be undone.\n Cancel\n Confirm",
  "crawledAt": "2026-02-19T03:38:53.690Z"
}