{
  "url": "https://riviantrackr.com/news/rivian-puts-hands-free-driving-behind-a-paywall-offers-free-trial-through-april",
  "path": "/news/rivian-puts-hands-free-driving-behind-a-paywall-offers-free-trial-through-april",
  "title": "Rivian Puts Hands-Free Driving Behind a Paywall, Offers Free Trial Through April",
  "text": "Skip to content\nRivian is officially tightening up what Autonomy+ actually means, and yep, hands-free driving is now firmly part of it.\nStarting today, Universal Hands-Free and other assistive features live under Autonomy+, Rivian’s growing driver assistance bundle from Rivian. Just like new R1S and R1T deliveries, existing owners get temporary access too. Your vehicle will have all Autonomy+ features enabled through April 4, 2026, basically a free trial to see if hands-free driving fits your daily grind or long road trips. (just in case this whole time you’ve had it for free wasn’t enough)\nIf you’re into it, Autonomy+ will run $49.99 per month or a one-time $2,500 purchase per vehicle. The one-time purchase is tied to the vehicle’s VIN, not the owner, so it stays with the vehicle if you sell it. Rivian Reward points can cover some or all of that one-time fee, which softens the blow a bit. This is Rivian clearly saying advanced software features are moving to a paid tier, and now owners get to decide if hands-free cruising is worth it.\n 27 Comments \n The important question about the $2,500 is “Can Universal Hands-Free be transferred from one Rivian to another?”\n If you did the one-time purchase, it goes with the vehicle.\n I’ve been using the hands free and when compared to tesla, Rivian has a long way to go. I don’t doubt they will get there eventually, but I also don’t see $49.99/mo of value at this time.\n Agreed-certainly not in rural idaho.\n I also agree, my son has a model 3 , you could let a 10 year old drive it with their Full Self Driving. It stops at traffic lights and starts again when the traffic clears/ or the light turns green. It makes Turns (by itself) and lets you look away for more then 3 seconds (such as looking down at your phone)\nI love my R1 2nd Gen but the tech is still years away from Tesla, Rivian you got everything else right- fix this and I’m sold.\n I’m still having problems with the basic free Driver+ features of the Gen 1. Their lack of support to work out the bugs has kept me from buying a Gen 2, and I won’t even consider the R2 until they start selling it with lidar.\n This will be an easy pass for me\n I couldn’t figure out what to do after I click on the link the email. It took me to my account where I already had Connect+ but there’s not Autonomy+\n Not there just yet but you are on your 60 day trial now.\n I wonder if you’ll be able to turn it on and off monthly. If I’m doing a long road trip and would like the features for that time, then turn it off after.\n Can enable through your account. Enablement through the app is coming February 17th.\n Jose – any indication on when the additional features will come (e.g on ramp to off ramp)? Could this launch signify the additional features coming soon?\n Just 2026 is what I’m told but I’m excited to see what February’s OTA will include.\n Jose – can you find out if you can subscribe for a month, cancel, subscribe another month, cancel, etc. Similar to what many people do with Tesla’s charging subscription. Allows you to activate it for 30 days to take a trip, etc, then deactivate until needing it again.\nI went to the online new car configurator and it only offered the $2,500 one time pay option. Do people who want the subscription model opt out of the one time purchase and then subscribe monthly after getting it?\n Yes, you’ll be able to sub and unsub on a per month basis!\n Stupid. Just such a bad decision and at such the wrong time. Smells of deaperation for cash.\n Two years to go on my lease. I haven’t decided if I will pay the flat fee or subscribe but I’ll probably be on board one way or the other. When I leased my R1T I knew that I was signing up for a ride. I had been following Rivian since they bought the old Mitsubishi plant in Normal and I was fascinated by the effort to build a new vehicle starting with a blank sheet of paper. To me, this is part of that journey. \nDid I “need” the performance package? No. Would I have added a $2500 autonomy package to my lease? Hell yes.\nI would love to see a comparison of the number of software engineers per vehicle produced in all of the car companies. Ongoing development costs money. Aggressive development costs even more. This is about supporting that development on an ongoing basis.\nI simply don’t understand the emotional reactions. If you are happy with your Rivian as is don’t sign up. If you want to enjoy the addition of new features, pay the fee. But don’t throw a fit because you aren’t getting something you didn’t pay for.\n Why would you add $2500 to your lease? Unless you have a 50+ month lease, it’s cheaper to spend $50/month.\n People who already purchased their vehicles didn’t know how expensive the subscription would be and nobody wants to be hit over the head with a $50/month fee after buying a $100k vehicle. You also can’t trust that Rivian won’t come up with some other package to ensure your $2500 isn’t all inclusive. They’ll go back to the well for Autonomy++.\nHere’s to hoping consumers shut this shit down before we have to subscribe to a windshield wiper package if we want to drive in the rain. Ongoing development to improve the programming for those rain sensors costs money.\n Among the many other points here about trust and bait and switch of what the baseline vehicle is and is not…. The stupidity is that we want Rivian to survive. When you see such obvious missteps (or desperation) it hits deep because the company itself can’t survive at this level of dumb. If I hated Rivian or wanted them to fail I wouldn’t care. I care because I want an R1s gen 4. And I know that stupidity won’t win out in the long term.\n Agreed & you are Correct on all accounts!\n > don’t throw a fit because you aren’t getting something you didn’t pay for\nI can empathize with people who purchased a $100k+ vehicle who feel like that should be all inclusive.\n Jose, Have you tested Comma 3/4? and how to compare to Autonomy +?\n I have not, those only work on Gen 1 right now.\n Will Gen 2 vehicles continue to have the basic Driver + features (Standard Highway Assist, Adaptive Cruise Control, Lane Keeping Assistance) if you don’t get the Autonomy+ subscription?\n A subscription should be tied to an ongoing service. Autonomy+ fits that model because it’s continuously improving. The steady stream of development, enhancements, and refinements is the service customers are paying for.\nDriver+ (Gen 1), on the other hand, isn’t really evolving beyond critical bug fixes. Without regular improvements, there’s no ongoing service and hence does not qualify as a subscription.\nThere’s also a business upside to consider. Subscriptions create Annual Recurring Revenue (ARR), which generally leads to higher company valuations. A higher valuation makes it easier to raise capital, invest in new ideas, expand the product, and ultimately build better things for everyone. Look at Tesla, it offers FSD as subscription only, and they are not desperate for cash.\n I enjoy and use hands-free a lot, but it is incredibly unreliable. On the I-90 driving from North Bend to Seattle in Washington State, anyway. Whenever there is an exit, my Rivian gets confused and will try to take the exit, then try to stay in the lane, and you end up going straight at the concrete divider. I have to take control on swerve back onto the freeway to avoid what looks like it will be a tragic accident at 70 mph. I now know this will happen, so I overpower hands-free at these exits.\nI understand this is new and that it requires driver attention and will put up with it while it’s free, but charging me $2500 for something that is this unreliable isn’t right. It feels like a desperate grab for cash. \nTo be clear, my Electric Porsche Macan does not make these mistakes. It’s not hands-free, but it is auto-steering as long as you rest your hand on the wheel.\nRivian should learn now that selling beta/unfinished software and promoting it as worth charging customers more for will cause more brand-negativity than not having the feature at all.\n Leave a ReplyCancel ReplyYour email address will not be published. Required fields are marked *\n Name  *\n Email  *\n Add Comment *\n Save my name and email in this browser for the next time I comment.Post Comment \nΔ",
  "crawledAt": "2026-02-19T03:38:01.448Z"
}