{
  "url": "https://www.rivianroamer.com/software-updates/2025-46",
  "path": "/software-updates/2025-46",
  "title": "Rivian Software Update 2025.46 | Rivian Roamer",
  "text": "Rivian Software Update \n 2025.46\n Wide Open\n Released December 18, 2025\n Get notified before Rivian tells you\n Join 6,200+ Roamers getting early alerts by linking your Rivian account - it's free!\n Join and Connect\n Fleet Rollout Progress\n Eligible\n 99%\n 5,121 out of 5,151 vehicles\n Installed\n 99%\n 5,112 out of 5,151 vehicles\n Connect+\n 100%\n 4,520 out of 4,532 vehicles\n Non-Connect+\n 97%\n 601 out of 619 vehicles\n Release Notes\n Gen 1 R1S\n •\n Gen 1 R1T\n •\n Gen 2 R1S\n •\n Gen 2 R1T\n •\n RivianTrackr\n Driver Display Now Customizable\n You can now switch between the Driver Assistance view, which shows vehicles and objects up ahead, and the Maps and Navigation view on the driver\n display. Press the right thumbwheel on the steering wheel to swap.\n Note: While showing the Maps and Navigation view, the driver display automatically switches back to the Driver Assistance view if\n you engage Highway Assist, or if the Park Assist sensors are triggered.\n Navigation\n When the vehicle isn't following a route, Navigation now zooms out on the map and shows more geographical context, such as buildings and parking\n lots.\n At the start of a route, you now have a brief window to select alternate routes after you choose the Home button, the Work button, or Go on a\n search item.\n We improved the loading performance of the Navigation app.\n Additional Improvements\n Improved drive mode behavior by saving the selected Regen setting per drive mode.\n Improved the loading performance of SiriusXM.\n Improved passive entry performance with the iPhone 17.\n Fixed a rare issue that kept the liftgate from closing properly.\n Gen 2 Exclusive\n Universal Hands-Free\n Universal Hands-Free steers, accelerates, and brakes your vehicle on roads with marked lanes, allowing you to let go of the steering wheel for\n extended periods, as long as you're looking at the road. Universal Hands-Free is now available on more than 3.5 million miles (5.6 million km) of\n roads in North America and relies on Driver Attention Detection to confirm that you're paying attention to the road ahead of you.\n When Universal Hands-Free is available on a marked road as indicated by the Universal Hands-Free icon near the speedometer, pull the drive stalk\n towards you twice to activate Universal Hands-Free.\n System Limitations:\n Universal Hands-Free is an advanced driver assistance feature designed to support the driver, but doesn't replace the driver's attention,\n judgment, and need to control the vehicle.\n Universal Hands-Free doesn't make your vehicle autonomous or self-driving. Stay alert at all times of road conditions. Always be prepared to\n take control of the vehicle if needed.\n Universal Hands-Free doesn't automatically stop at traffic lights and stop signs. Notifications may appear, and you must take the appropriate\n action in these scenarios. It is your responsibility to follow traffic laws.\n Universal Hands-Free doesn't update the set speed automatically as the speed limits change. It is your responsibility to monitor the posted\n speed limits and adjust the set speed.\n Universal Hands-Free doesn't make turns or follow navigation instructions. If you're in a turn-only lane, you must take control of the vehicle\n and steer it appropriately.\n Don't use Universal Hands-Free on slippery, unpaved, wet, or snowy roads.\n Universal Hands-Free won't do the following:\n Drive the vehicle through high curvature roads such as roundabouts and sharp turns.\n Detect special-use lanes such as bike lanes, bus lanes, and emergency lanes.\n Detect and react to oncoming or crossing vehicles, uncommon objects, or odd-shaped objects including, but not limited to, open doors,\n barrels, poles, debris, and trailers.\n React promptly to road users around blind corners, crossing intersections, and narrow driving situations.\n Slow down or stop for speed bumps, dips, upcoming traffic lights, or stop signs.\n Steer in response to temporary lane lines marked by cones, barrels, or similar construction materials.\n React to special crossing scenarios such as railway crossings.\n Follow navigation prompts or make turns in turn lanes.\n Autonomy Drive Styles\n Autonomy Drive Styles allow you to customize the driving behavior of our driver assistance systems and features: Universal Hands-Free, Highway\n Assist, Adaptive Cruise Control, and Lane Change on Command.\n Choose Mild for a relaxed style with more gap distance and more gradual lane changes.\n Choose Medium for a balanced style to manage cut-ins and accelerate with traffic flow.\n Choose Spicy for a more dynamic style with a tighter gap distance and quicker steering during lane changes.\n To change Drive Styles while you drive, press the thumb control buttons on the right side of the steering wheel.\n Updated Control to Adjust Speed\n To adjust speed while in Universal Hands-Free, Highway Assist, or Adaptive Cruise Control, roll the right thumbwheel up or down on the steering\n wheel.\n Enhanced Autonomy View\n The Autonomy View now zooms out to show more of the area behind your vehicle, so you have more context for maneuvers such as lane changes and\n turns.\n Rivian Digital Key\n Use the new digital key through the native Wallet app on your iPhone and Apple Watch, Google Pixel, or Samsung device to seamlessly access and\n drive your vehicle. Digital key offers these benefits:\n Greater reliability for passive entry.\n Enhanced accuracy and security with the use of UWB (Ultra Wide Band) technology.\n Improved interoperability across devices.\n Ability to easily share up to 8 keys with family and friends.\n Vehicle access via NFC (Near Field Communications) for up to 5 hours after your phone runs out of battery power.\n Digital key is available with the vehicle software version 2025.46 or later and the Rivian mobile app version 3.8.0 or later.\n RAD Tuner Drive Mode: Create, Customize, Curate\n The Rivian Adventure Department (RAD) brings you RAD Tuner, which was developed by the team behind our historic wins at Rebelle Rally and Pikes\n Peak International Hill Climb.\n Exclusive to Quad-Motor vehicles, this feature allows you to go beyond the factory presets and optimize the vehicle's dynamic behavior for your\n preferences and the terrain. Use intuitive touch sliders to build and save custom drive modes by adjusting these independent settings:\n Acceleration\n Regen\n Brake assist\n Steering assist\n Ride height\n Torque balance\n Wheel slip\n Stability\n Damping\n Roll stiffness\n Introducing Kick Turn\n For Quad-Motor vehicles only, boost its off-road agility with Kick Turn. By leveraging the power of all four motors working together, your vehicle\n can now rotate in place or significantly reduce its turning radius while moving at speeds under 15 mph (24 km/h).\n Whether you are navigating a tight hairpin, tackling a switchback, or turning around on a blocked trail, you can now pivot precisely where you need\n to go. No more 3-point turns—go off-road and kick it responsibly.\n Enhanced Throttle Control\n Enhanced throttle control for more responsive vehicle handling in the Soft Sand, Rally, and Drift modes, if available. The accelerator pedal offers\n more precise control in the less restrictive Stability settings, Reduced and Off, so you have finer control to adjust wheel slip and vehicle attitude\n (its orientation in space).\n Charging\n Improved stability of AC charging.\n Improved robustness of AC charging in cold weather conditions.\n Additional Gen 2 Fixes\n Fixed a rare issue that affected 12 V battery health in cold weather.\n Gen 1 Exclusive\n Charging\n Fixed an issue that kept the vehicle from charging on the set schedule.\n Fixed an issue that prevented charging from ending when you pressed the charge port button to stop the charging session and the schedule was\n active.\n Fixed issues that prevented the charger handle from being unplugged after DC fast charging ended.\n Fixed an issue that impacted the charge port indicator and the in-vehicle charge status display.\n Additional Gen 1 Fixes\n Fixed an issue that disabled phone proximity features in rare conditions.\n Fixed an issue that prevented the Rivian mobile app from updating the current drive mode.\n Fixed a rare issue that caused the 12 V battery to drain when the vehicle woke from sleep.\n Build Versions\n Platform-specific builds for each generation\n Gen 1\n 2021-2024\n 2025.46.0\n d296071\n Released December 22, 2025\n Notes\n 2025.46.0\n 7ea9d7f\n Released December 18, 2025\n Notes\n Gen 2\n 2025+\n 2025.46.30\n b35582b\n Released January 08, 2026\n Notes\n 2025.46.0\n d296071\n Released December 22, 2025\n Notes\n 2025.46.0\n 7ea9d7f\n Released December 18, 2025\n Notes\n This action cannot be undone.\n Cancel\n Confirm",
  "crawledAt": "2026-02-19T03:41:00.600Z"
}