{
  "url": "https://www.rivianroamer.com/software-updates/2026-03",
  "path": "/software-updates/2026-03",
  "title": "Rivian Software Update 2026.03 | Rivian Roamer",
  "text": "Rivian Software Update \n 2026.03\n Cold Snap\n Get notified before Rivian tells you\n Join 6,200+ Roamers getting early alerts by linking your Rivian account - it's free!\n Join and Connect\n Upcoming Software Update\n Rivian Roamer spotted this version in the wild, but it hasn't started rolling out yet. We'll update this page the moment we see release notes or rollout activity.\n When this update goes live, you'll see:\n Complete release notes (new features, bug fixes, changes)\n Live rollout tracking (which vehicles are getting it, how fast it's spreading)\n Eligibility status for your vehicle\n Not sure how Rivian's rollout process works? Read our software updates guide.\n What's Coming\n RivianTrackr\n Cold Weather ImprovementsWe have made several improvements to give you better visibility into how cold weather can affect your vehicle range and what you can do to manage it.The vehicle and the Rivian mobile app now let you know when, and by how much, your range is affected by cold weather.The driver display, Energy app, and Rivian mobile app include a battery graphic that uses blue shading to indicate how much energy is temporarily unavailable.The vehicle and the Rivian mobile app provide preemptive notifications when your vehicle is most susceptible to range loss and when your range has reduced due to the battery becoming cold.When your range is impacted or may become impacted, you can open a guide in the Rivian mobile app which provides insight on improving your experience in cold weather. It includes information on how to recover range due to cold and other useful tips, like scheduling your drive, using Snow mode, and conditioning the cabin before driving. You can also access the guide in the support articles at rivian.com/support.We improved charging logic to better prepare the battery pack for your next drive and help recover energy more predictably.Note: Cold-weather and range loss notifications require version 3.9 or later of the Rivian mobile app.Apple Watch AppThe latest Rivian mobile app update includes a companion app for your Apple Watch. This allows you to remotely access and control your vehicle from your Apple Watch.Gen 2: Access to your vehicle is easy: passive entry is automatically enabled if your digital key is set up. Walk up to your vehicle, and it automatically unlocks as you approach. Then you can start to drive.Gen 1: Access to your vehicle is easy: you can lock or unlock your vehicle with a tap of the Lock icon. With the app open, you can start to drive.You can also use the Apple Watch app to lock or unlock your doors, vent your windows, or sound the alarm, all with a simple tap on your wrist. For even more control, use the digital crown to set a target state of charge or adjust the cabin temperature. Additionally, the app's customizable design lets you choose up to four quick controls for instant access to the features you use most. Go to the Owner's Guide on the center display for more information about all the Apple Watch app has to offer.Note: The Apple Watch app requires version 3.9 or later of the Rivian mobile app. Gen 1 owners must foreground the Apple Watch app to ensure that your Apple Watch can be used as a key for your Rivian vehicle.Exciting New Updates for Drive ModesWe further enhanced the driving experience:Gen 2: Performance Dual-Motor now offers Launch mode, which is designed for use on a closed circuit track in dry road conditions and provides racing stats for 0-to-60 mph (0-to-100 km/h) and quarter-mile race times, along with visualizations and driver coaching. Go to Drive Modes and choose Sport mode on the center display. Then choose Launch mode and follow the on-screen instructions. For more information and important warnings, go to the Owner's Guide and search for Launch mode.Gen 1: Performance Dual-Motor and Quad-Motor now offer Launch mode, which is designed for use on a closed circuit track in dry road conditions and provides racing stats for 0-to-60 mph (0-to-100 km/h) and quarter-mile race times, along with visualizations and driver coaching. Go to Drive Modes and choose Sport mode on the center display. Then choose Launch mode and follow the on-screen instructions. For more information and important warnings, go to the Owner's Guide and search for Launch mode.Sport mode is now available on all Dual-Motor variants. Sport mode prioritizes on-road vehicle performance and optimizes responsiveness and handling in all-wheel drive.Sport mode now offers Standard ride height.Sport mode now offers Firm and Moderate ride feel settings to more accurately reflect the vehicle's performance.Gen 2: For Quad-Motor and Tri-Motor, we have increased the top speed in Rock Crawl mode to 33 mph (53 km/h) to enable more usability between obstacles on trail.Gen 1: For Quad-Motor, we have increased the top speed in Rock Crawl mode to 33 mph (53 km/h) to enable more usability between obstacles on trail.Gen 2: You can now change between all on-road drive modes and adjust ride height, ride feel, and brake regen settings while Adaptive Cruise Control and Universal Hands-Free are engaged.Gen 1: You can now change between all on-road drive modes and adjust ride height, ride feel, and brake regen settings while Adaptive Cruise Control and Highway Assist are engaged.Enhanced Kneel ModeGetting in and out of your vehicle just got a whole lot smoother. We've redesigned Kneel Mode to be more responsive, more accessible, and available exactly when you need it.Your vehicle will now lower even further in Kneel Mode, making it easier than ever to enter, exit, or load gear.We've re-engineered our algorithms so your vehicle can now kneel from High ride height and across all on-road drive modes, including All-Purpose, Sport, Conserve, and Snow.You can now trigger Kneel Mode on demand via a new Quick Control option to activate the lowering process while traveling at low speeds, less than 20 mph (32 km/h).If Kneel Mode isn't available due to specific conditions, we'll let you know why. If the Kneel icon is greyed out in your Quick Controls, simply choose it to learn more about why Kneel is unavailable.Thanks, Cambry, for the feedback!Unreal Engine 5 UpgradeWe upgraded our software to use Unreal Engine 5.5 for the three-dimensional renderings shown on the driver and center displays, including the Autonomy view (Gen 2) / Driver Assistance view (Gen 1) and apps such as Drive Modes and Settings. Improvements include better anti-aliasing, smoother animations, and increased capability to render a larger number of surrounding vehicles, bicycles, and pedestrians on the driver display.Additional ImprovementsFlorida Power & Light FPL EVolution charging locations with real-time status and speed information now appear in maps and navigation.InfotainmentFixed an issue that caused the FM radio to be stuck in a reconnecting state.Addressed several display and layout issues on the Drive Modes Gauges view.Fixed an issue that caused the infotainment system to crash when you swiped on the Drive Modes screen.General stability and performance enhancements.Gen 2 ExclusiveFixed an issue that caused Universal Hands-Free to issue take over requests when approaching toll gantries.Fixed an issue that caused Universal Hands-Free to not automatically re-engage after a manual lane change.Advanced the timing of notifications when approaching traffic lights and stop signs while Universal Hands-Free is active.Updated notifications for Universal Hands-Free.Fixed an issue that deployed door handles when the vehicle switched from Drive to Park when Car Wash mode is active.Fixed an issue that kept rearview guidelines and camera buttons from appearing in live camera views on the center display.\n This action cannot be undone.\n Cancel\n Confirm",
  "crawledAt": "2026-02-19T03:40:57.980Z"
}