{
  "url": "https://riviantrackr.com/news/rivian-r2-will-use-radar-not-ultrasonic-sensors",
  "path": "/news/rivian-r2-will-use-radar-not-ultrasonic-sensors",
  "title": "Rivian R2 Will Use Radar, Not Ultrasonic Sensors",
  "text": "Skip to content\nEditor’s Note: When I first published this, I stated that R2 would be dropping ultrasonic sensors and moving to a vision-only setup. After going back and revisiting Rivian’s Autonomy Day presentation from December 2025, that wasn’t fully accurate. I unpublished the original article because it needed correction.\nBack at Autonomy Day, Rivian confirmed that R2 would eliminate the visible ultrasonic pucks in the front and rear bumpers and instead rely on upgraded corner radar units for short-range detection and parking assistance. The goal is cleaner design with no visible sensors, while still maintaining high-resolution sensing around the vehicle.\nOn R1 today, those ultrasonic sensors handle close-range object detection. They bounce sound waves off nearby objects and calculate distance, which is especially useful when creeping into tight garages, backing toward a wall, or navigating close obstacles at low speeds. They work well in low light and do not depend on camera clarity.\nWith R2, Rivian is replacing that short-range ultrasonic layer with enhanced radar capability at the corners. Radar can measure distance and object movement more robustly than ultrasonics and can perform better in adverse conditions like rain, snow, dust, or darkness. The tradeoff is that radar integration and software tuning need to be dialed in to match the precise parking feel people are used to.\nThis is not a Tesla-style vision-only move. It is more of a hardware consolidation strategy. Rivian is simplifying the exterior by removing visible ultrasonic sensors, while leaning on higher-resolution corner radar for both close-range detection and broader driver assistance functions.\n Source: InsideEVs\n Photo taken at Rivian’s Autonomy & AI Day\nAnd the bigger story is still coming.\nLater in 2026, R2 is expected to add LiDAR as part of Rivian’s next-generation autonomy hardware. LiDAR provides direct depth measurement using laser pulses, adding another layer of environmental understanding on top of cameras and radar. That means R2’s sensor stack will evolve over time, not shrink.\nSo the corrected takeaway is this. R2 is not losing short-range sensing capability. It is shifting from ultrasonic sensors to corner radar units, while preparing for an even more advanced multi-sensor setup that includes LiDAR down the road.\nSometimes getting the details right means hitting pause and updating the story. This is one of those times.\n 4 Comments \n Deal killer. I’ll wait for lidar. Have that on my Chinese cars in Mexico. Worked great. Bye-bye and obsolete vehicle. Wait for the lidar.\n The Lidar discussion here is a red herring. Lidar won’t be positioned to see objects very close the vehicle.\nCorner radar is fine, but again doesn’t really do the job of ultrasonics. The bill-of-materials wins again. Reducing cost is clearly priority over top notch autonomy.\n Your commenter is both uneducated and clueless. This is top tech in the industry and surpasses any of the Chinese trash out there.\n Think of Chinese cars as “trash” at your own peril. The Chinese car makers are competing against each other in a brutal market, and the rest of the world’s manufacturers are paying attention.\n Leave a ReplyCancel ReplyYour email address will not be published. Required fields are marked *\n Name  *\n Email  *\n Add Comment *\n Save my name and email in this browser for the next time I comment.Post Comment \nΔ",
  "crawledAt": "2026-02-19T03:37:25.764Z"
}