{
  "url": "https://riviantrackr.com/news/rivian-developing-new-electric-van-variant-with-bigger-battery-and-awd",
  "path": "/news/rivian-developing-new-electric-van-variant-with-bigger-battery-and-awd",
  "title": "Rivian Developing New Electric Van Variant With Bigger Battery and AWD",
  "text": "Skip to content\nRivian is now developing a new variant of its Electric Delivery Van, and this feels like the natural next step after proving the platform at scale.\nUp to this point, the primary EDV on the road has been the front wheel drive, standard battery configuration, which has already validated itself across more than 30,000 vans operating daily. Now Rivian is working on two meaningful upgrades, a larger battery pack and an all-wheel drive setup, both aimed squarely at improving route flexibility and real world operating capability.\nThe larger battery is expected to deliver roughly a 30% increase in range, which in fleet terms is not just a spec bump but a logistics advantage, allowing vans to cover longer or more spread out routes on a single charge while reducing dependency on tightly managed charging windows. For Amazon, that translates to broader network coverage and more operational breathing room.\nAdding all-wheel drive is just as strategic. Deliveries do not pause for snowstorms, mud, steep driveways, or rough terrain, and additional traction can make the difference between smooth operations and costly delays. AWD expands where the EDV can confidently operate, opening the door to colder climates and more demanding regions where front wheel drive alone may have faced limitations.\nAnd then there is the question many of you keep asking, and honestly I am right there with you, when does Rivian finally open orders to individual buyers who want to turn this purpose built commercial van into the ultimate electric #VanLife platform?\n 8 Comments \n I’d be first in line for an AWD Van Life Rivian\n Lets goooo!\n Will be buying one for sure!\n GM just cancelled BrightDrop due to expense an lack of sales. BrightDrop is a bigger battery van that couldn’t find a market at that price point with the bigger battery. What is Rivian going to do differently to succeed in a space that GM failed at?\n Rivian is actually working with Amazon, as an example, to build vans they need with the home comforts a delivery driver would need or require. Rivian is also pushing hard on the vans whereas GM didn’t really try. I went to a dealership that had 5 BrightDrop’s and I wanted to learn more, the people working there knew nothing about them. That was issue number one.\n Why can’t gm bring back awd in the savanna GMC?\n The Brightdrop and Rivian have no ground clearance – so they would be terrible in anything but a ski lodge parking lot… \nI am all for an electric AWD van – but so far all are not suitable for even mild off-road use.\n More garbage from an absolute garbage brand. Speaking as a DSP Manager who has 31 of these plastic shit boxes in our fleet I can tell you with confidence they’re terrible. Constant mechanical issues and long turn around times on repairs thanks to Rivian canning a large portion of their repair teams to make way for the R2 launch make these vans nightmare to use on a daily basis. Sure the 30% increase in battery sounds nice until you realize they’ll barely be cracking 200 miles on a charge in optimum conditions, and rarely do we see optimum battery life even on nice days. The inclusion of all wheel drive is just going to blunt that 30% increase given the extra weight penalty the system will incur. Add that to the still existing from launch issues regarding prematurely worn half shafts (4 to worry about instead of 2, yippee). Oh and can we talk about the build quality… Or lack there of? Seats that break if you look at them wrong, cameras that go out constantly thanks to poor design choices, bullhead door motors that give out after a few weeks of use, and keys that just refuse to connect (yes Rivian, I changed the battery and am using the one random brand you recommend). Oh and do you think you could make the windshield any bigger? I think there’s still 1 or 2 rocks in California that haven’t cracked one yet. And gods forbid it be over 85°! Goodbye battery. Might as well hook a trailer to it with a generator at that point. These things are just awful\n Leave a ReplyCancel ReplyYour email address will not be published. Required fields are marked *\n Name  *\n Email  *\n Add Comment *\n Save my name and email in this browser for the next time I comment.Post Comment \nΔ",
  "crawledAt": "2026-02-19T03:37:13.220Z"
}